[
{"title": "What job could someone do better with super-strength, but without actually revealing that they have it?", "tag": ["economy", "super-powers"], "author": "Cyrus Drake", "link": "https://worldbuilding.stackexchange.com/questions/228931/what-job-could-someone-do-better-with-super-strength-but-without-actually-revea", "content": "\nBeing a superhero without being state-sponsored or independently wealthy is kind of a massive pain. You're essentially working two jobs, one of which is highly dangerous and doesn't even pay. So naturally, a lot of them would have a great deal of motivation to make their dayjob as high-pay, low-stress, and low-hours as they can make it, so they can put more of their energy into their herowork without running themselves ragged.\nOne option they have is to use the cards they've been dealt to their advantage and try to use their superpowers to get a job they can do way better, and way more easily, than any ordinary human. Let's say we're working with pretty basic, cookie-cutter superpowers here: someone who is significantly stronger, faster and tougher than any normal human could be. But the problem is that they still need to keep their powers a secret, so they can't, say, be seen on a construction site casually lifting a massive I-beam over one shoulder. At first blush, this seems like that dashes their options of using their superpowers to their advantage to make their dayjob easier and more lucrative. But does it?\nWhat sort of job could a superhuman be more productive than a human at, with less effort, without having to reveal to anyone that they are in fact a superhuman?\n"},
{"title": "Why did the Empire need the Death Star?", "tag": ["star-wars", "death-star"], "author": "Raul Valdez Jr.", "link": "https://scifi.stackexchange.com/questions/262574/why-did-the-empire-need-the-death-star", "content": "\nI wonder why they needed the Death Star as I’ve seen in comics and YouTube videos that a few star destroyers can basically destroy a planet though not to the extent of what the Death Star did to Alderaan. Isn’t that over kill?\nIn Darth Vader the Marvel comic 2017 Tarkin almost destroys Mol Cala with his Star destroyers.\n"},
{"title": "Is this expression Python 2/3 safe?", "tag": ["code-golf", "decision-problem", "parsing"], "author": "Sisyphus", "link": "https://codegolf.stackexchange.com/questions/246627/is-this-expression-python-2-3-safe", "content": "\nGiven an expression like 4 / 2 + 3, determine whether the expression has the same value in Python 2 and Python 3. Recall that in Python 2 division rounds down (so that 5 / 2 -> 2), whereas in Python 3 division returns a float (so that 5 / 2 -> 2.5).\nFor simplicity's sake, we will only consider expressions of the form:\na o1 b o2 c\n\nWhere\n\na, b, and c are numbers between 1 and 5 inclusive; and\no1 and o2 are either the addition, multiplication or division operators (+, *, /)\n\nNote that the restrictions mean the expression will always be the same length and will never have any zero division issues.\nSince this is in part a parsing challenge, you must take the input exactly as given including spacing in a string-like form appropriate for your language (and not, for example, a preparsed AST).\nYou can print or return any two distinct consistent values to indicate true or false.\nTest cases\n1 + 2 + 3 -> true\n2 * 3 + 5 -> true\n3 / 3 + 3 -> true\n4 / 2 * 2 -> true\n2 * 2 / 4 -> true\n4 / 2 / 1 -> true\n5 + 4 / 2 -> true\n\n1 / 2 + 3 -> false\n5 / 2 * 2 -> false\n3 / 2 * 4 -> false\n2 + 3 / 5 -> false\n4 / 4 / 4 -> false\n\nScoring\nThis is code golf, shortest code in bytes wins.\n"},
{"title": "Russian gas delivery stop — difference between Poland/Bulgaria and other EU customers?", "tag": ["european-union", "russian-federation", "poland", "energy-policy", "bulgaria"], "author": "gerrit", "link": "https://politics.stackexchange.com/questions/72842/russian-gas-delivery-stop-difference-between-poland-bulgaria-and-other-eu-cust", "content": "\nOn 2022-04-27, the Russian state-owned energy company Gazprom has ceased gas deliveries to Poland and Bulgaria, after they refused to henceforth pay for the gas in ruble rather than the currency stated in the contract.  Other EU countries and customers in those countries have also refused to pay for gas deliveries in ruble.  For example, 97% of gas payments in the EU are in euro or dollar.  Is there any factual difference that would explain why gas deliveries were stopped to (customers in) Poland and Bulgaria, but not to other EU customers?  Or is this purely a political decision based on (semi-)opaque political considerations from the Russian Federation leadership?\n"},
{"title": "Is it normal for a reviewer to comment about suitability for publication after addressing their comments?", "tag": ["publications", "peer-review"], "author": "Daweise", "link": "https://academia.stackexchange.com/questions/184598/is-it-normal-for-a-reviewer-to-comment-about-suitability-for-publication-after-a", "content": "\nI have a paper submission that now is going through the second round of revisions.\nReviewer #1 suggested publishing after some minor changes, while reviewer #2 has been more critical of the piece. Anyway, I submitted the revised paper and reviewer #2 now requested some minor changes, which editors agree with and asked me to address.\nThe reviewer wrote:\n\nIf the author can addresses these comments then the paper would be suitable for publication. (sic)\n\nIs such a tone normal/usual for reviewers to use? I mean it is the editor who decides whether a paper is suitable for publication or not; what reviewers are expected to share their comments on the paper.\nI have sensed a kind of gatekeeper attitude with that tone. Am I being too sensitive or has the reviewer indeed gone a bit too far?\n"},
{"title": "Is it true that men are forced to pay child support for children they didn't consent to have?", "tag": ["sex-discrimination", "child"], "author": "obfuscated", "link": "https://law.stackexchange.com/questions/79652/is-it-true-that-men-are-forced-to-pay-child-support-for-children-they-didnt-con", "content": "\nAccording to many in the men's rights movement, a woman who, in any way, gets pregnant from a man will be able to get child support from him, which in most states is proportional to a man's wealth.\nThis is even if the man clearly didn't consent to have children.\nFor example, Drake once allegedly put Tabasco in a used condom to avoid fathering a child with a woman he doesn't want to have children with. Many say that if a woman successfully takes semen from a discarded condom and impregnates herself, then she is not punished, but the father would be forced to pay child support.\nIs it true that there are no laws that protect men from non-consensual reproduction?\n\nThe child is really his biologically\nThe man consented to sex, but not to having children\nThe woman did something non-consensual so that the man would impregnate her\nThe woman is eligible for child support anyway\n\nJurisdiction? Any country you know.\nIn Indonesia, I know that a man can choose not to support any child. So I have never heard a case of stealthing against men. Of course, if the child is really the man's child and the sex is consensual and the child is not there due to malicious acts, quite often the man chooses to take care of the child anyway.\n"},
{"title": "When is the earliest that a vampire could have traveled from Europe to North America?", "tag": ["ships", "sea-exploration"], "author": "Cyrus Drake", "link": "https://worldbuilding.stackexchange.com/questions/229073/when-is-the-earliest-that-a-vampire-could-have-traveled-from-europe-to-north-ame", "content": "\nI'm writing an urban fantasy story revolving around, among other things, vampires secretly living in the United States in 1998. And since the first two vampires came into existence in the area that is now known as Romania in around 1450, a question I need to have a solid answer for is when, exactly, they came to America, and more to the point, when that would have been physically possible.\nSea travel is a bit of an issue for vampires, you see, for two very important reasons:\n1: While the strongest of them can do things like fly, manipulate the weather and control human minds, they have a weakness to both the sun and open water. The celestial energies Earth radiates out from its core take on different properties depending on what non-gaseous material they last passed through. If it was more than three feet of water followed by less than three feet of any other solid matter, it will be as if a vampire were standing in direct sunlight. Either sunlight or open water on their own would rob a vampire of all of their advanced powers. Exposure to both at once would further rob them of their strength, leaving them weaker than the average human (and those are the most powerful; to any lesser vampire a combination of sun and open water would be utterly lethal). So no flying across the ocean; they need a ship.\n2: In my setting, magical beings such as vampires cannot under any circumstances stray from human civilization for longer than a month, specifically during the full moon. A phenomenon known as moontime occurs every full moon, and it keeps the supernatural population in check by making any area that's seen excessive immortal foot traffic (more than 1 in 1,000 humans on average over the course of the month) exceedingly lethal for the immortals caught there during the full moon. Being caught out at sea with nobody nearby but the humans on a single ship, therefore, would be a death sentence. So the journey across the sea has to take no more than 30 days.\nI don't expect provisions to be an issue for the voyage. Vampires require a pint of blood every 12 hours they are awake, but can hibernate during daytime and they possess a magical method of preserving human blood in glass bottles, so no need to start draining their crew.\nWith these facts in mind, when is the soonest that human seafaring technology could have allowed a vampire to survive the voyage from Europe to North America?\n"},
{"title": "Dealing with Symmetry. Commercial solver defaults vs manual implementations", "tag": ["mixed-integer-programming", "gurobi", "symmetry"], "author": "user3711946", "link": "https://or.stackexchange.com/questions/8313/dealing-with-symmetry-commercial-solver-defaults-vs-manual-implementations", "content": "\nSince the modeler has domain/business knowledge of the problem being solved, is it possible to manually implement Isomorphism Pruning or Orbital branching and beat the default methods implemented by the solvers  under the hood. Also, some of the advice, especially here on OR-SE is to not even add symmetry breaking constraints and let the solver exploit/handle it. Thoughts?\nManually implementing isomorphism pruning or orbital branching is quite involved. Anyone can provide code sample using a commercial solver (Gurobi/Cplex/Xpress)?\n"},
{"title": "Is it theoretically possible to sail from north east Russia to Pakistan in a straight line?", "tag": ["geography", "oceanography"], "author": "Gandalf", "link": "https://skeptics.stackexchange.com/questions/53234/is-it-theoretically-possible-to-sail-from-north-east-russia-to-pakistan-in-a-str", "content": "\nI found this map from this substack, World in motion:\n\nRohan Chabukswar and Kushal Mukherjee, a pair of researchers at the\nUnited Technologies Research Center in Cork, plotted the route in 2018\nin response to a question posed by Live Science. They worked out that,\nif you set off from the coast of Pakistan, it would be possible to\nsail for nearly 20,000 miles – between Africa and Madagascar, narrowly\nmissing the coast of South America – before hitting land again in the\nfar north east of Russia.\nAnd although it looks like a curve on a two-dimensional map, your\ntheoretical boat would actually be sailing in a completely straight\nline.\n\n\nIt claims you can sail from north east Russia to Pakistan in a straight line. How is this true?\n"},
{"title": "How could a planet logically have green clouds but still be habitable?", "tag": ["science-based", "environment", "atmosphere", "weather"], "author": "user16768946", "link": "https://worldbuilding.stackexchange.com/questions/229068/how-could-a-planet-logically-have-green-clouds-but-still-be-habitable", "content": "\nI am working on a game currently with some predetermined assets, and one of the areas I am developing takes place on a mountainous, lush jungle planet with low-hanging green clouds and a general green fog-like haze.\nWhat factors could cause a planet to regularly develop these green atmospheric conditions while remaining habitable?\n"},
{"title": "Is it unethical not to disclose a reduction in travel cost due to delays when getting reimbursed for business trip?", "tag": ["travel", "reimbursement"], "author": "Sursula -they-", "link": "https://workplace.stackexchange.com/questions/184403/is-it-unethical-not-to-disclose-a-reduction-in-travel-cost-due-to-delays-when-ge", "content": "\nI recently had a business trip and used the train to travel. On the way back, there was a significant delay leading to missing a connecting train and as a result, I arrived more than one hour late. When being more than 60 minutes late, the train company will return you 25% of the train fare.\nDue to this being a business trip, I will get reimbursed for the train ticket (which I had to buy myself). If I don't tell my company, they will never know that I got 25% of the return ticket back.\nMy question: Is it unethical not to tell them that there was a delay and I actually paid less than the original price? On the one hand, I would save them money. On the other hand, the trip was approved beforehand (with the original train price) and I was personally inconvenienced by the delay, not the company (as I was traveling back on a Saturday, a day on which I normally don't work).\n"},
{"title": "Did Luc Besson ever explain why Zorg really wants the arrival of the evil?", "tag": ["the-fifth-element"], "author": "Wingfoot", "link": "https://scifi.stackexchange.com/questions/262595/did-luc-besson-ever-explain-why-zorg-really-wants-the-arrival-of-the-evil", "content": "\nWhat exactly does Zorg expect from the arrival of the \"Great Evil\"? Once it would have reached the temple, life would turn into death, including Zorg's life. He tried to explain to Fr. Vito Cornelius why, but it still doesn't make sense. What did Zorg expect from the evil for himself?\n"},
{"title": "How can a pulsar slow down?", "tag": ["angular-momentum", "conservation-laws", "astrophysics", "gravitational-waves", "pulsars"], "author": "velut luna", "link": "https://physics.stackexchange.com/questions/705793/how-can-a-pulsar-slow-down", "content": "\nI saw in some astronomy textbooks that pulsars gradually slow down due to the loss of energy by its radiation. I wonder why this is possible?\nAlthough the radiation is now not thermal but in the form of two beams, I think they still cannot carry away net angular momentum but just net energy. So while energy decreases the angular momentum should be conserved. The only way to have decreasing energy but constant angular momentum is to have increasing momentum of inertia by\n$$E=\\frac{L^2}{2I}$$\nwhich is clearly not what happens to a pulsar.\nSo should it be the gravitational waves emitted that carries away the angular momentum and slow down the rotation, just like the case of orbital motions slowing down in binary neutron star or blackhole systems?\n"},
{"title": "How to finish PhD", "tag": ["phd", "advisor", "health"], "author": "Anton_P", "link": "https://academia.stackexchange.com/questions/184687/how-to-finish-phd", "content": "\nI'm doing my PhD in mathematics (Germany) since four years, and I have agreed with my supervisor that I should finish within the next half a year.\nI am not very confident that this is a realistic perspective. In the past four years, I have worked on various things, but have hardly been successful in any of these endeavours. Apart from actually developing results, it was already hard to find good questions to work on. My supervisor has made clear that it's not his role to help my find good problems to work on.\nAnyway, I am working on a particular project since three years. I have some results, but I would them deem quite disappointing for the time I invested. The project involved some algorithmic developments, which ate most of the time; but certainly, no one will award me any degree for having developed and implemented some algorithm that's neither particular efficient, nor particularly interesting, nor about which any theoretical properties I can prove. To summarize, my results are very, very weak (I'd say much less of mathematics than what I did in my Master's).\nThus, I'm constantly asking myself: \"what could I write my thesis about then?\"\nWhen I approach my supervisor and tell him that I don't estimates my results by any means sufficient for a graduation, he tells me to stay confident and to continue working on my project. I have started suspecting that telling my to stay confident is just the way of least resistance for him, which allows him to avoid any uncomfortable discussion.\nI already notice that my sleep quality, ability to concentrate, to enjoy pleasant moments or to optimistically look into the future have drastically deteriorated, and I am asking myself almost every day: \"what could life look like when I actually have failed?\"\nHow could I deal with the situation?\n"},
{"title": "Can I govern an ebike down to a lower speed?", "tag": ["electric-bike"], "author": "David", "link": "https://bicycles.stackexchange.com/questions/83692/can-i-govern-an-ebike-down-to-a-lower-speed", "content": "\nI commute on my bike for fun and exercise, but my commute has two steep hills that kill my legs and add a significant amount of time to my route.\nI've looked at ebikes for their electric-assist ability as a way to smooth out the steep uphill experience, but I still like biking and still want to get my exercise on other parts of the ride.\nIs it possible to configure an ebike so that it only provides an assist at low speed, on hills, and is entirely unassisted above something like 7-10mph?\n"},
{"title": "Dispensing fair shares of inhomogeneous soup", "tag": ["soup", "serving"], "author": "Cong Chen", "link": "https://cooking.stackexchange.com/questions/120447/dispensing-fair-shares-of-inhomogeneous-soup", "content": "\nI love noodle soup and doling out bowl after bowl of it, but I have noticed that ingredients are not evenly distributed between bowls. However I have noticed that the bowls, even when filled to the same level, contain different quantities of solid ingredients, potentially very different quantities of noodles, solid ingredients, garnish and liquid! With long noodles this is exacerbated by the tendency of the noodles to come out together and it is particularly difficult to ensure that subsequent servings have similar distribution to initial ones.\nAs this issue is visible to the naked eye I imagine that only the tip of the iceberg is being observed and there is much more unobserved unevenness.\nHow can I effectively dispense roughly even compositions of home served noodle soup with solid ingredients into multiple bowls a) served at the same time or b) in sequence?\nThings I have tried:\n\nGoogle searches for fair serving noodle soup - nothing relevant found\nCut or break the noodles into much smaller pieces - this reduces the\nclumping issue for noodles and puts them in the same class as other\nsolid ingredients but sometimes one wants long noodles\nZig-zag over\nthe bowls adding a little bit at a time - this is time consuming and\nparticularly susceptible to clumping effects\n\n"},
{"title": "Existence of nontrivial categories in which every object is atomic", "tag": ["ct.category-theory", "examples", "counterexamples", "cartesian-closed-categories"], "author": "varkor", "link": "https://mathoverflow.net/questions/421198/existence-of-nontrivial-categories-in-which-every-object-is-atomic", "content": "\nAn object $X$ of a cartesian closed category $\\mathbf C$ is atomic if $({-})^X \\colon \\mathbf C \\to \\mathbf C$ has a right adjoint (hence is also internally tiny). Intuitively, atomic objects are \"very small\" (as the name suggests), and consequently there aren't usually many tiny objects in $\\mathbf C$.\nHowever, is this necessarily the case? More precisely, do there exist any non-posetal cartesian closed categories in which every object is atomic?\nIf there are no non-posetal examples, are there any nontrivial posetal examples? (The terminal category forms a trivial example of a posetal example.)\n"},
{"title": "How to interpret 'a friend in need is a friend indeed'?", "tag": ["meaning-in-context", "idioms"], "author": "Michael", "link": "https://ell.stackexchange.com/questions/314205/how-to-interpret-a-friend-in-need-is-a-friend-indeed", "content": "\nIn both the Free Dictionary and the Collins Dictionary, 'in need' means 'lacking something'. So, the proverb 'a friend in need is a friend indeed' should mean 'a friend lacking something is a true friend' literally.\nHow come the proverb means 'someone who helps you when you are in need is a true friend'? Isn't a phrase like 'in need' supposed to modify the noun or subject preceding it? Are there other examples where a phrase does not modify the subject preceding it?\n"},
{"title": "How does this PNP transistor improve the switching performance of MOSFET?", "tag": ["power-supply", "mosfet", "transformer", "switch-mode-power-supply", "gate-driving"], "author": "Divya K.S", "link": "https://electronics.stackexchange.com/questions/617572/how-does-this-pnp-transistor-improve-the-switching-performance-of-mosfet", "content": "\n\nMy guess is  PNP transistor might ensure fast turn off by shunting the gate capacitance (ie, when diode is reverse biased and the PNP is on.)\nAdditional questions:\n\nWhy is the gate current limiting resistance not present?\nWhat is the role of R1 in Fig 2.7?\n\nRef: https://toshiba.semicon-storage.com/info/docget.jsp?did=59460\n"},
{"title": "What is happening every time I pay my credit card? Am I 'settling' with my bank, the credit card company, or another entity?", "tag": ["credit-card", "payment", "online-payment"], "author": "StatsScared", "link": "https://money.stackexchange.com/questions/150646/what-is-happening-every-time-i-pay-my-credit-card-am-i-settling-with-my-bank", "content": "\nI understand that credit cards extend credit to customers. And that purchases incurred before the credit balance is due are nothing more than IOUs to either the bank issuing the card (and also the card provider?).\nBut is actually happening every time I pay off my credit card? Am I 'settling' with the bank and/or card provider by wiring them a final payment that is actually settled?\n"},
{"title": "Why would far-left groups oppose Macron’s re-election?", "tag": ["presidential-election", "ideology", "france"], "author": "GendoIkari", "link": "https://politics.stackexchange.com/questions/72814/why-would-far-left-groups-oppose-macron-s-re-election", "content": "\nAs a background to this question, I know next-to-nothing about French politics other than briefly reading a few news articles about current events.\nIn response to the re-election of Emmanuel Macron in the 2022 election, some violent protests and riots have broken out in France. Macron's opponent, Marine Le Pen, has been referred to as \"far-right\" by multiple news sources. Without knowing much about Macron's policies; it seems clear that he is the more left-wing candidate of the two.\nBut it seems like these protests and riots are being carried out by far-left groups. This seems very confusing to me; even if far-left groups don't generally support Macron (similar to how far-left groups in the U.S.A. don't tend to support Biden because he is too moderate), shouldn't they be happy about this election outcome, as opposed to a victory by Le Pen?\nWhy are left-wing groups protesting an election in which the right-wing candidate lost?\nhttps://www.news.com.au/world/europe/deadly-violence-breaks-out-in-paris-as-police-charge-protesters-furious-at-macrons-reelection/news-story/35ee330a949207ed472f356cb78c3931\n"},
{"title": "Why would hydrogen bubble up from the sea floor?", "tag": ["underwater", "sea", "fuels"], "author": "wokopa", "link": "https://worldbuilding.stackexchange.com/questions/229077/why-would-hydrogen-bubble-up-from-the-sea-floor", "content": "\nI am thinking of a world where bubbles of hydrogen emerge from the seafloor, and are trapped by people for use as fuel.\nBut what is the source of the hydrogen? In other words, what geological or maybe biological/bacterial processes would cause masses of H₂ to bubble up through the sea in a reliable way?\nThe people will have technology like 20th-century Terra with which to trap/harvest it.\nThanks\n"},
{"title": "Does Bob have a case if he ends up paying child support due to Alice's deceit?", "tag": ["fraud", "damages", "consent", "child-support"], "author": "Greendrake", "link": "https://law.stackexchange.com/questions/79674/does-bob-have-a-case-if-he-ends-up-paying-child-support-due-to-alices-deceit", "content": "\nThis question is inspired by and closely related to that one, but is different.\nAlice deperately wants to conceive and give birth to a child from Bob, but Bob is adamant. He is very careful to avoid becoming a father for a number of reasons, one of them not willing to pay child support. Alice and Bob are not a couple. They're both single, just see each other from time to time. They have agreed to only have protected sex, specifically Bob always uses condoms (although he wishes he did not have to). He accepts that no contraception is 100% reliable, but is fine to take the risk so long as it is reasonably mitigated and Alice is honest in her willingness to use contraception.\nOne day Alice tells Bob that he does not have to use condoms anymore: she's now got her own contraception (e.g. pills, implant in her arm, IUD, whatever). Bob is hesitant — not because he doubts Alice is saying true, but because he prefers being safe than sorry. But Alice convinces him that her contraception is in place and reliable, and they have consensual sex without a condom. In fact, the is no contraception at all because Alice has blatantly lied — in order to become pregnant from Bob. So she does, and Bob starts paying child support.\n(Alternative facts: Alice picks up Bob's used condom from the rubbish bin as soon as he leaves, and impregnates herself with the sperm in it).\nSo, while paying child support diligently, Bob finds out that he was fooled. He obtains strong evidence of the Alice's deceit.\nCan Bob possibly have a case against Alice directly (not against having to pay the child support)? Bob accepts that, as the child now exists, he has to pay their support anyway. However, does that preclude claims against the mother for causing the expenses Bob explicitly was aiming to avoid?\nCan such a case possibly be quantified based on the child support he now has to pay?\nUnderstandably, such a case against Alice would adversely affect the child (if Alice is the one to raise them). However, any payouts to Bob could be delayed until the child becomes adult, or remain stand-by in case Alice inherits large sums of money, wins a lottery etc.\n(Any jurisdiction that you can answer about).\n"},
{"title": "Is there a way to not include the {{ content }} variable in a node template and still have the node cache clear when the node is updated?", "tag": ["caching"], "author": "quantumized", "link": "https://drupal.stackexchange.com/questions/310882/is-there-a-way-to-not-include-the-content-variable-in-a-node-template-and", "content": "\nWe have nodes that have dozens of fields and have elected to not include the {{ content }} variable as it is tedious and looks messy having something like the following just to not print the fields. We're manually outputting each field as needed like {{ content.myfield }}.\nThe problem is that when the {{ content }} variable is not in a template then that node's cache does not get cleared when a user modifies the node's content and they have to contact and admin to clear the Drupal caches.\nSurely there must be a way to have a node's cache cleared when it is updated and its theme template does not have the {{ content }} variable. Please help.\n{{ content|without('field_blog_posts','field_breadcumb_t','field_call_to_action','field_call_to_actions_title','field_customer_support_body','field_customer_support_button_te','field_customer_support_image','field_customer_support_title','field_hero_body','field_solutions_hero_image','field_hero_link_1','field_hero_link_2','field_hero_title','field_learn_more_text','field_meta_tags','field_newsletter_signup_banner','field_newsletter_signup_banner_m','field_product_spotlight_title','field_read_more_link_text','field_section_one_category_1','field_section_one_category_2','field_section_one_sub_title','field_section_one_title','field_section_one_video','field_section_two_category_1','field_section_two_category_2','field_section_two_sub_title','field_section_two_title','field_section_twovideo','field_section_two_view_all_link','field_spotlighted_product') }}\n\n"},
{"title": "Novel about people on a generational ship who experience no external senses, except language-based communication", "tag": ["story-identification", "generation-ship"], "author": "AtomicSource", "link": "https://scifi.stackexchange.com/questions/262588/novel-about-people-on-a-generational-ship-who-experience-no-external-senses-exc", "content": "\nI once read the start of a novel in the SciFi section of a book store, but silly me didn't buy it & I haven't been able to find it again. If someone could identify it, that would bring me joy, relief, and a new book to read.\nThe book beings with a teenage girl describing the wind rustling the leaves of a tree to a teenage boy. The boy can almost picture the tree in his mind: this is significant because not only have the two never seen a tree or felt wind, they have never seen, touched, tasted or even heard, anything their whole lives. They have never experienced any external sensory input except an abstract sense of words, of language, from other people. Everyone is living on a generational ship from Earth, heading to some far away planet. Through teachers, and mentally reading archives,  they've learnt that their ancestors used to live on Earth, and experienced things like color & sound. But they've struggled to get more than a vague sense of what it was like to have these stimuli.\nThe boy was the narrator, and he spoke of how the two of them would often take turns trying to describe some physical phenomena to the other, attempting to feel what it was like seeing, or feeling the wind on their face etc. I think he said she was better at it than him.\nThat's all I can remember from the book; that, and I got the sense all humans on their ship lived these 'sense-less' lives to save resources.\nI read (the start of) this book as a new paperback sometime between 2011 to 2016 in Dymocks bookstore in Australia, so it was likely published between 2005-2015. It was posssibly YA, given the protagonists' ages. I have a memory of the book having a single-word title with an exclaimation at the end, but I might be mixing it up with another book I saw at the store.\nI've continued to be intrigued by the concept of a society of people who never experience external stimuli other than some 'direct' form of langague (that apparently doesn't involve any sense of hearing).\n"},
{"title": "Native English speakers: worse understanding of other accents?", "tag": ["english", "reference-request", "pronunciation", "accent", "mutual-intelligibility"], "author": "Alex", "link": "https://linguistics.stackexchange.com/questions/44361/native-english-speakers-worse-understanding-of-other-accents", "content": "\nIn this video, Lily Tomlin (an American) doesn't really understand what Kevin Bridges is saying at all with his Scottish accent. She also says she doesn't fully understand what Chris Hemswoth (an Australian) is saying either. Chris Hemsworth says that \"he understood bits and pieces\" of Kevin's speech (a joke?). Lily also says she fully understands Graham Norton (Irish accent).\nI am a non-native speaker of English and I understood everything, this seems quite surreal.\nWhat is going on? Has there been any research on this?\n"},
{"title": "bash count files in path with wildcard and assign to a variable", "tag": ["bash", "shell-script"], "author": "IGGt", "link": "https://unix.stackexchange.com/questions/700606/bash-count-files-in-path-with-wildcard-and-assign-to-a-variable", "content": "\nWhat am I missing?\nI want to find out how many files match a given pattern in a directory and assign it to a variable.\nIf I type it all straight on the command line it works fine\nls /backups/system\\ db\\ files/temp/daily/backup_filename_202203*.tar.gz | wc -l\n\n(n.b. the * is the date the backup was created, e.g. 01, 02, 03 etc.)\nBut as soon as I add it to my bash script it fails.\nSo far I have:\nbase_dir=\"/backups/system\\ db\\ files/temp\" \nsub_dir=\"${base_dir}/daily\"\nfilename_base=\"backup_filename_\"\n\nand I then try and run:\ncounter=$(ls ${sub_dir}/${filename_base_}202203*.tar.gz | wc -l)\n\nor with quotes:\ncounter=$(ls \"${sub_dir}/${filename_base_}202203*.tar.gz\" | wc -l)\n\nThe first one fails as it tries to split it based on the whitespaces.\nThe second one doesn't expand the * to look for the wildcards.\nI have tried just quoting some of it, e.g.\ncounter=$(ls \"${sub_dir}/${filename_base_}\"202203*.tar.gz | wc -l)\n\nBut again it ignores the wildcard.\nI've been searching but for the life of me can't find a way to get the total number of matching files.\n"},
{"title": "How to move forward with unfulfilling internships", "tag": ["software-industry", "internship"], "author": "SpaceHeater334", "link": "https://workplace.stackexchange.com/questions/184421/how-to-move-forward-with-unfulfilling-internships", "content": "\nI am currently a 3rd year college student pursuing a degree in computer science.  As part of my degree, I am required to complete a number of co-ops/internships. These are paid internships in the United States. Students are fully responsible for securing theses positions themselves (searching, applying, interviewing, etc.). It is great experience to have in an early career, but it also means the quality of the positions can vary depending on where you get offers from. I have completed one summer internship and am in the middle of an 8-month internship at a separate company (both software engineering roles).\nWhile these have started out as exciting opportunities to get \"real world\" experience, both internships eventually devolved into mostly unfulfilling work that make me question my career choice as a whole.\nMy biggest grievances with these experiences have been the following:\n\nUnsatisfying workload: The amount of work I have been assigned is often way less than what I am capable of handling.  My managers always praise the pace and quality of my work, but there has simply not been enough to keep me occupied and engaged. Addressing this with comments such as \"I feel like I could be taking on more responsibility\" has not resulted with much change.\nNo collaboration: I have been the sole developer on all of the projects I have been assigned.  While having a high degree of freedom is nice, I feel like it has limited my early career learning and growth.  Not having the opportunity to collaborate with other coworkers or pick the brains of more senior developers has limited me to doing only what I am capable of teaching myself.\nLittle constructive criticism: Being an undergrad student with less than one year of work experience, I fully understand that I have a lot to learn when it comes to my skills as a developer and overall employee.  However, I feel that I don't receive the criticism necessary to make these improvements.  Code reviews have ranged from non-existent to very informal, and directly asking for ways I can improve has not been fruitful.\n\nWhile there have been moments where these internships have felt challenging and rewarding, I'd say the grievances listed above have caused them to feel unfulfilling a majority of the time.  I do enjoy the technical challenge that programming provides, but not enough to justify dealing with these issues.\nAre these just unfortunate experiences that don't reflect the software industry as a whole?  If so, how can I make the most of my time to hopefully secure a better opportunity in the future?\nIf this is actually reflective of life in the software industry, do I need to do some soul searching when it comes to my career path?\n"},
{"title": "What kind of U.S. visa do I need to visit my current employer's office in the U.S.?", "tag": ["usa", "b1-b2-visas", "us-visa"], "author": "Dmitry", "link": "https://travel.stackexchange.com/questions/173312/what-kind-of-u-s-visa-do-i-need-to-visit-my-current-employers-office-in-the-u", "content": "\nI am from Belarus, but I live and work in Germany. My current employer is an American company with an office in Germany.\nI have the opportunity to visit the office in the US, but a visa is needed for that, since I have a Belarusian passport.\nAs I know, I cannot apply for a B1/B2 visa because I will be working in the US office for a week or two.\nWhat kind of visa do I need to visit a U.S. office and work there for a short period of time?\n"},
{"title": "In Critical Role Campaign 2, did Caleb keep a stock of pearls for casting Fortune's Favor?", "tag": ["dnd-5e", "spells", "spell-components", "critical-role-show"], "author": "Thomas Markov", "link": "https://rpg.stackexchange.com/questions/197969/in-critical-role-campaign-2-did-caleb-keep-a-stock-of-pearls-for-casting-fortun", "content": "\nAccording to this spreadsheet compiled at Crit Role Stats, Caleb cast fortune's favor 36 times over the course of Campaign 2. Notably, fortune's favor has material component:\n\na white pearl worth at least 100 gp, which the spell consumes\n\nNow, I know Caleb had at least one pearl, often used to cast identify (I quote its first use in this answer), but I do not recall Caleb ever buying more pearls or talking about the pearls being consumed for the purpose of casting fortune's favor. Am I remembering that correctly, or did Caleb routinely maintain a stock of pearls that were consumed by castings of fortune's favor, which I have just forgotten about?\nThe reason I ask is that I remember the spell being pretty good - a reroll on anything, attack, check, or save, at the cost of a 2nd level spell slot seems pretty decent, but having just reviewed the spell and noticed the 100 gp consumed component, it now seems like a pretty steep cost for a one-time reroll. I've been using the spell wrong, regarding my recollection of Caleb's use of it as an in vivo play test of the spell having no consumed costly components.\n"}
]