[
{"title": "Origin of the \"angry/excited\" meaning of \"go nonlinear\"", "tag": ["meaning", "usage", "phrase-origin"], "author": "theonlygusti", "link": "https://english.stackexchange.com/questions/588089/origin-of-the-angry-excited-meaning-of-go-nonlinear", "content": "\nLexico gives an additional definition of \"go non-linear\" as:\n\ngo non-linear\ninformal\nbecome very excited or angry, especially about a particular obsession\ndon't mention the drug problem or he'll go non-linear for hours.\n\nWhat's the history of this sense?\n"},
{"title": "How to move forward with unfulfilling internships", "tag": ["software-industry", "internship"], "author": "SpaceHeater334", "link": "https://workplace.stackexchange.com/questions/184421/how-to-move-forward-with-unfulfilling-internships", "content": "\nI am currently a 3rd year college student pursuing a degree in computer science.  As part of my degree, I am required to complete a number of co-ops/internships.  I have completed one summer internship and am in the middle of an 8-month internship at a separate company (both software engineering roles).\nWhile these have started out as exciting opportunities to get \"real world\" experience, both internships eventually devolved into mostly unfulfilling work that make me question my career choice as a whole.\nMy biggest grievances with these experiences have been the following:\n\nUnsatisfying workload: The amount of work I have been assigned is often way less than what I am capable of handling.  My managers always praise the pace and quality of my work, but there has simply not been enough to keep me occupied and engaged. Addressing this with comments such as \"I feel like I could be taking on more responsibility\" has not resulted with much change.\nNo collaboration: I have been the sole developer on all of the projects I have been assigned.  While having a high degree of freedom is nice, I feel like it has limited my early career learning and growth.  Not having the opportunity to collaborate with other coworkers or pick the brains of more senior developers has limited me to doing only what I am capable of teaching myself.\nLittle constructive criticism: Being an undergrad student with less than one year of work experience, I fully understand that I have a lot to learn when it comes to my skills as a developer and overall employee.  However, I feel that I don't receive the criticism necessary to make these improvements.  Code reviews have ranged from non-existent to very informal, and directly asking for ways I can improve has not been fruitful.\n\nWhile there have been moments where these internships have felt challenging and rewarding, I'd say the grievances listed above have caused them to feel unfulfilling a majority of the time.  I do enjoy the technical challenge that programming provides, but not enough to justify dealing with these issues.\nAre these just unfortunate experiences that don't reflect the software industry as a whole?  If so, how can I make the most of my time to hopefully secure a better opportunity in the future?\nIf this is actually reflective of life in the software industry, do I need to do some soul searching when it comes to my career path?\n"},
{"title": "Are .img files block-aligned like actual filesystems?", "tag": ["linux", "filesystems"], "author": "Dennis", "link": "https://superuser.com/questions/1718006/are-img-files-block-aligned-like-actual-filesystems", "content": "\nFilesystems like ext4 are block-aligned, meaning files are aligned to blocks of a predefined size, typically 4 KB in the case of ext4. If an .img file is created from such a filesystem, can I assume that the individual files are 4k aligned in the created .img file, just like they are in the real filesystem?\nIn other words, say we have two 1 KB files called foo and bar, which appear on the physical drive as below, with each [] representing 1 KB.\n[foo][][][][bar][][][]\n\nIn this case, foo and bar are 4k aligned. Now, if we create an .img file for this filesystem, are the contents of foo and bar still 4k aligned from the start bit of the img file?\n"},
{"title": "Is it normal for a reviewer to comment about suitability for publication after addressing their comments?", "tag": ["publications", "peer-review"], "author": "Daweise", "link": "https://academia.stackexchange.com/questions/184598/is-it-normal-for-a-reviewer-to-comment-about-suitability-for-publication-after-a", "content": "\nI have a paper submission that now is going through the second round of revisions.\nReviewer #1 suggested publishing after some minor changes, while reviewer #2 has been more critical of the piece. Anyway, I submitted the revised paper and reviewer #2 now requested some minor changes, which editors agree with and asked me to address.\nThe reviewer wrote:\n\nIf the author can addresses these comments then the paper would be suitable for publication. (sic)\n\nIs such a tone normal/usual for reviewers to use? I mean it is the editor who decides whether a paper is suitable for publication or not; what reviewers are expected to share their comments on the paper.\nI have sensed a kind of gatekeeper attitude with that tone. Am I being too sensitive or has the reviewer indeed gone a bit too far?\n"},
{"title": "Is DMCA takedown applicable for MIT License?", "tag": ["licensing", "copyright", "github", "dmca"], "author": "user18915229", "link": "https://opensource.stackexchange.com/questions/12818/is-dmca-takedown-applicable-for-mit-license", "content": "\nI have a MIT licensed repository which is entirely copied just replacing the author name. I've heard that MIT takes away most copyright and permits free use. But if anyone can copy code and even just replace my name with his one, what is necessity of MIT License? Can I submit a DMCA takedown notice(of github) in my case? Do I even need a lawyer for this? As a student I can't afford so and I cannot even allow such copying. This discourages open source developers.\n"},
{"title": "Gnossiennes and Free Time", "tag": ["time-signatures", "tempo", "beats", "engraving", "meter"], "author": "Elements in Space", "link": "https://music.stackexchange.com/questions/122513/gnossiennes-and-free-time", "content": "\nI'm looking at Erik Satie's Gnossiennes, specifically Nos. 1-3, but for simplicity let's just consider Gnossienne No. 1.\nMost editions (see IMSLP) are engraved without a time signature nor with any bar lines.  This suggests unmetered \"free time\".\nA tempo indication of \"Lent\" (AKA Lento/Slow) is also provided, and text (in french) also gives some rather obscure expression instructions.\nHere is the first line of No. 1:\n\nLooking at the music, and in several recordings I have heard, the bass line and chords definitely look and sound like they provide undeniable (yet somewhat syncopated) beats. There is a repetitive pattern that I would describe as: being in a 2/2 meter, with the bass notes on 1, and the chords on the-and-of-1, and the-and-of-2. (Or if you prefer 4/4, the chords on beats 2 and 4.)\nBut this contradicts the idea of \"free time\", and doesn't explain the lack of time signature and bar lines.\nAdmittedly a significant amount of rubato is applied by the various performers (and it does suit this piece). But rubato only affects the tempo, not the meter right?\n\nAre the Gnossiennes really in \"free time\"?\nIs there some other reason that the time signature and bar lines are absent?\nDoes omitting the time signature and bar lines make it easier or harder to perform this piece?\n\n"},
{"title": "What job could someone do better with super-strength, but without actually revealing that they have it?", "tag": ["economy", "super-powers"], "author": "Cyrus Drake", "link": "https://worldbuilding.stackexchange.com/questions/228931/what-job-could-someone-do-better-with-super-strength-but-without-actually-revea", "content": "\nBeing a superhero without being state-sponsored or independently wealthy is kind of a massive pain. You're essentially working two jobs, one of which is highly dangerous and doesn't even pay. So naturally, a lot of them would have a great deal of motivation to make their dayjob as high-pay, low-stress, and low-hours as they can make it, so they can put more of their energy into their herowork without running themselves ragged.\nOne option they have is to use the cards they've been dealt to their advantage and try to use their superpowers to get a job they can do way better, and way more easily, than any ordinary human. Let's say we're working with pretty basic, cookie-cutter superpowers here: someone who is significantly stronger, faster and tougher than any normal human could be. But the problem is that they still need to keep their powers a secret, so they can't, say, be seen on a construction site casually lifting a massive I-beam over one shoulder. At first blush, this seems like that dashes their options of using their superpowers to their advantage to make their dayjob easier and more lucrative. But does it?\nWhat sort of job could a superhuman be more productive than a human at, with less effort, without having to reveal to anyone that they are in fact a superhuman?\n"},
{"title": "Why are magnetic monopoles \"incompatible\" with quantum mechanics?", "tag": ["quantum-mechanics", "electromagnetism", "magnetic-monopoles"], "author": "10GeV", "link": "https://physics.stackexchange.com/questions/705385/why-are-magnetic-monopoles-incompatible-with-quantum-mechanics", "content": "\nI'm reading this Physics Today article on magnetic monopoles, and I'm a bit confused by a discussion of the necessity of Dirac strings for compatibility with quantum mechanics. I'll reproduce the relevant discussion here:\n\nAt first sight, magnetic monopoles seem to be incompatible with\nquantum mechanics. This is because, in quantum mechanics,\nelectromagnetic fields have to be described in terms of a scalar\npotential $\\phi$ and vector potential, $\\vec{B} = \\nabla \\times \\vec{A}$, and it\nfollows [that] the field must then be sourceless, $\\nabla \\cdot \\vec{B} = 0$\n\nIt's clear, of course, that if $\\vec{B} = \\nabla \\times \\vec{A}$, then $\\nabla \\cdot \\vec{B} = 0$. I don't understand, however, what quantum mechanics has to do with any of this.\nUnder classical electrodynamics, the magnetic vector potential is defined to be that whose curl gives the magnetic field. Together with electric potential $\\phi$, we may specify the electric field.\nIt is stated earlier in the article that magnetic monopoles are compatible with classical electrodynamics. It goes on to suggest that they are (seemingly) incompatible with quantum mechanics, but then argues this using what seems to be classical electrodynamics.\nHow is this related to QM?\n"},
{"title": "Do you know protocols, where it is necessary to obtain several \"independent\" points on the same elliptic curve?", "tag": ["public-key", "elliptic-curves", "protocol-design", "protocol-analysis", "elliptic-curve-generation"], "author": "Dimitri Koshelev", "link": "https://crypto.stackexchange.com/questions/99807/do-you-know-protocols-where-it-is-necessary-to-obtain-several-independent-poi", "content": "\nConsider an elliptic curve $E$ defined over a finite field $\\mathbb{F}_{\\!q}$ with a fixed non-zero $\\mathbb{F}_{\\!q}$-point $P$. For simplicity, let the order of the $\\mathbb{F}_{\\!q}$-point group $E(\\mathbb{F}_{\\!q})$ be prime and hence the group is generated by $P$. For the sake of security, in numerous protocols of elliptic cryptography (e.g., in a safe version of Dual_EC_DRBG) we need to generate yet another \"independent\" $\\mathbb{F}_{\\!q}$-point $Q$ on $E$.\nPlease answer the question. Do you know protocols, where it is necessary to obtain more \"independent\" $\\mathbb{F}_{\\!q}$-points on the same curve ? In other words, a party deals with \"independent\" $\\mathbb{F}_{\\!q}$-points $Q_1$, $Q_2$, $\\ldots$, $Q_n$ in addition to $P$. By \"independent\" I mean such points that no one knows the discrete logarithms relative to each other.\nI ask you, because for some $E$ and $n$ I know how to produce simultaneously several $Q_i$ faster than separate generation of them. I would like to understand whether my approach is worthy of publication in a good scientific journal. Or maybe it even has something to do with real world cryptography.\n"},
{"title": "MAC address table and frame forwarding on Layer 2 switches - question about when two computers are connected via hub to same switch port", "tag": ["cisco", "switch", "ethernet"], "author": "Deepak", "link": "https://networkengineering.stackexchange.com/questions/78640/mac-address-table-and-frame-forwarding-on-layer-2-switches-question-about-when", "content": "\n\nMy apologies if this is not the right forum to ask this, but I am a newbie when it comes to networking. I am currently going through the CISCO Networking Essentials course, and one of the Activities in the second module left me confused. Basically computers with MAC addresses 0E and 0F are both connected to a hub, which connects to a single Layer 2 switch port (Fa9). The question starts with the assumption that a MAC address table entry already exists for 0E (Fa9) but none yet for 0F. If computer with MAC 0E were to address a frame to computer with MAC 0F, how would that ever reach its destination? As I understand it, the switch, not \"seeing\" 0F in its table would flood the frame out all connected ports except Fa9 (incoming), but that means the frame will never exit via Fa9, so how is computer with MAC 0F ever supposed to receive the frame?\nThanks in advance for your help.\n"},
{"title": "Shift a string gradually", "tag": ["code-golf", "string"], "author": "Bgil Midol", "link": "https://codegolf.stackexchange.com/questions/246556/shift-a-string-gradually", "content": "\nGiven an input string and a wrapping string, find the location of the first input string char in the wrapping string and replace it with the wrapping string char 1 step to the right of that, find the second char in the wrapping string and replace it with the char 2 steps to the right, find the third and replace it with the char 3 steps to the right, and so on. If there are not enough chars in the wrapping string, wrap around.\nThe wrapping string does not have duplicates and the input string will always be made of chars in the wrapping string.\nReference implementation\ns, wrap = input(), input()\nn = 1\nres = \"\"\nfor char in s:\n    res += wrap[(wrap.index(char) + n) % len(wrap)]\n    n += 1\n    \nprint(res)\n\nTest Cases\nabc abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ => bdf\n\nxyz abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ => yAC\n\nZZZ abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ => abc\n\n<empty string> <empty string> => <empty string>\n\nabcdefg abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ => bdfhjln\n\n123 0123456789 => 246\n\n121212 12 => 222222\n\nScoring\nThis is code golf, so the shortest answer wins!\n"},
{"title": "Can Alarm be used to detect hidden creatures?", "tag": ["dnd-5e", "spells", "monsters"], "author": "Raaid Khan", "link": "https://rpg.stackexchange.com/questions/197933/can-alarm-be-used-to-detect-hidden-creatures", "content": "\nAlarm can be cast over a 20×20×20 ft (or smaller) area within a range of 30ft, and has a casting time of 1 minute.\n\nUntil the spell ends, an alarm alerts you whether a Tiny or larger creature touches or enters the warded area.\n\nI recently used this spell by casting and ritual casting it on chests, to see if they were mimics. It ended up backfiring, technically there was a mimic, but it was a tame one that was a part of a magic item.\nAnyway, from my understanding of the spell, this should work, and I thought it was a pretty neat trick to test chests. However, it seemed to be frowned upon, and I was told I could only use it in such a way this one time.\nI just want to know whether the use of Alarm to detect whether a creature is in an area, is a valid use of the spell according to RAW. Of course, exempting Tiny Beasts when you cast the spell, so that you don't get screwed over.\n"},
{"title": "What should be used instead of Mister in a formal setting when foreign titles are involved?", "tag": ["titles"], "author": "Avogado", "link": "https://english.stackexchange.com/questions/587997/what-should-be-used-instead-of-mister-in-a-formal-setting-when-foreign-titles-ar", "content": "\nI want to preface this that I am not an English native speaker but I am fluent in the language. I am organizing an event and one of our foreign guests insists on not being called Mister Family_name because he sees it as disrespectful. He has both a PhD and an hereditary title. My boss doesn't want to use Doctor Family_name because it's a professional title. The guest’s nobiliary title does not map to any noble hierarchy in the English language. He's simply \"not-commoner\".\nAs I understand it, \"Mister\" is only appropriate when the person has no titles. I don't like formalities but I despise incorrect formalities.\nWhat is the appropriate way to address a foreign noble?\n"},
{"title": "Unexpected email from Computational and Applied Mathematics registering me as an editor and then sending me a paper to review - thoughts?", "tag": ["journals", "paper-submission", "editors"], "author": "Science Man", "link": "https://academia.stackexchange.com/questions/184529/unexpected-email-from-computational-and-applied-mathematics-registering-me-as-an", "content": "\nA few days ago I received an email from the journal Computational and Applied Mathematics\n\nPlease be informed you have been registered by our editorial team as a user on the Editorial Manager site for Computational and Applied Mathematics.  Information about Computational and Applied Mathematics can be found on the journal website, or by selecting Journal Overview from the top navigation bar at https://www.editorialmanager.com/coam/.\nEditorial Manager is the manuscript submission and peer-review tracking system through which individuals are invited to review, to write articles for the journal, or to process submissions.\n\nAnd this was followed by another email where they requested me to review a paper of someone I personally know!\nNow, I've a PhD in math but I've been outside academia for a while now (but actively trying to get back to mainstream research, while having a teaching position at an engineering college), so I've nothing against reviewing the paper - indeed it falls within my area of expertise. But I still found the whole thing a bit strange - I mean my registration in the editorial team without any prior discussion and then requesting me to review a paper. Also the work email they sent it to has never really been used much, so I wonder how they accessed that in the first place. It certainly doesn't look scammy, the paper is legit, and it came from this email: em@editorialmanager.com, which also seems legit.\nAny thoughts on this? Once again, I'd be happy to review the paper, but the whole thing just strikes me as strange.\n"},
{"title": "Has any space agency saved Earth from a major calamity any time?", "tag": ["nasa", "isro", "esa", "planetary-defense"], "author": "K. Yuta", "link": "https://space.stackexchange.com/questions/58963/has-any-space-agency-saved-earth-from-a-major-calamity-any-time", "content": "\nLike diverting meteor path away from Earth, or blasting giant asteroid which was expected to impact Earth, etc.\nHas any space agency saved Earth from a major calamity at any time?\n"},
{"title": "Is a fused disconnect essential for mini-split outdoor unit?", "tag": ["electrical", "hvac"], "author": "George Anderson", "link": "https://diy.stackexchange.com/questions/248305/is-a-fused-disconnect-essential-for-mini-split-outdoor-unit", "content": "\nI'm having a minisplit system installed in a rental. It's a Mitsubishi system. When I did this in other places, sometimes the installer is fine with an unfused local disconnect for the outdoor unit.   Other times they insist upon a true fused (not circuit breakers) disconnect for the unit.   My current installer is saying an unfused disconnect is just fine.  Thoughts?\n"},
{"title": "How do you respectfully portray a character that cannot walk when they have the power to visit an alternate dimension where they can walk?", "tag": ["world-building", "representation"], "author": "Nyctophobia457", "link": "https://writing.stackexchange.com/questions/61957/how-do-you-respectfully-portray-a-character-that-cannot-walk-when-they-have-the", "content": "\nContext\nIn my fantasy world, there are two realities that people travel back and forth between constantly. There is the \"real world\" where everyone travels when they are awake, and then there is the \"dream world\" where they all go when they are asleep.\nOne of my characters has an illness that prevents them from walking in the real world. They can get around fine with crutches, but they usually need a wheelchair.\nHowever, in the dream world they are able to walk normally without any assistance.\nThis is the heart of the issue.\nThe Problem\nI want to be respectful towards people who have physical disabilities, but if my character has the power to simply waltz into another dimension where they can walk perfectly fine whenever they want, it feels like it detracts from the character. Rather than having to learn and adapt because of their physical disability, the dream world feels like an excuse to handwave away any consequences the character might face due to their inability to walk.\nIt's like having a character with no legs, only to give them the power of flight. Or giving a person with no eyes the power of super-sonar that lets them sense things from crazy distances. Even though the character technically has a disability, the magic/supernatural elements scrub away most of the problems that the character would face due to it.\nOn one hand, I want to keep the character as they are. and I don't want to eliminate the idea of this magical otherword. Still, it feels wrong to write a character with a physical disability and then immediately do a 180 and say \"but you see, there's magic in this world, so the character can just hop into another dimension whenever they want and walk just fine there.\"\nI want to keep the world as is, and I want to keep the \"dream world\" parallel dimension, but I don't want to undermine the character's struggles with their disability just because they can go \"Any time I want to walk, I can hop into this alternate dimension where anything is possible. Isn't that convenient!\"\nAt best, that seems like bad representation. At worst it seems outright insulting to people with real disabilities.\nThe Question\nIf my character cannot walk in the real world, but has the ability to fall asleep and travel to a dimension where they can walk, how can I combine these two story elements without disrespecting people with real world disabilities?\n(To answer this question, please give one example of the best way these two elements could work together.)\n"},
{"title": "Can I put my rental in a trust and have the trust sell it?", "tag": ["united-states", "income-tax", "rental-property", "trusts"], "author": "Mr Monee", "link": "https://money.stackexchange.com/questions/150599/can-i-put-my-rental-in-a-trust-and-have-the-trust-sell-it", "content": "\nI probably am not the first to think of this and the IRS most likely has this covered but if one wanted to put their rental into a trust and then have the trust sell it, would they save on taxes since they no longer own the rental?\nThe rental in question is located outside the U.S., the one who wants to do this files a 1040 each year.\nEven if this is doable, who controls the rental, the trust doesn't think for itself so decides to sell it for the trust?\n"},
{"title": "Why would far-left groups oppose Macron’s re-election?", "tag": ["presidential-election", "ideology", "france"], "author": "GendoIkari", "link": "https://politics.stackexchange.com/questions/72814/why-would-far-left-groups-oppose-macron-s-re-election", "content": "\nAs a background to this question, I know next-to-nothing about French politics other than briefly reading a few news articles about current events.\nIn response to the re-election of Emmanuel Macron in the 2022 election, some violent protests and riots have broken out in France. Macron's opponent, Marine Le Pen, has been referred to as \"far-right\" by multiple news sources. Without knowing much about Macron's policies; it seems clear that he is the more left-wing candidate of the two.\nBut it seems like these protests and riots are being carried out by far-left groups. This seems very confusing to me; even if far-left groups don't generally support Macron (similar to how far-left groups in the U.S.A. don't tend to support Biden because he is too moderate), shouldn't they be happy about this election outcome, as opposed to a victory by Le Pen?\nWhy are left-wing groups protesting an election in which the right-wing candidate lost?\nhttps://www.news.com.au/world/europe/deadly-violence-breaks-out-in-paris-as-police-charge-protesters-furious-at-macrons-reelection/news-story/35ee330a949207ed472f356cb78c3931\n"},
{"title": "Why do North American Chinese restaurants advertise \"We use 100% Vegetable oil\"?", "tag": ["oil", "chinese-cuisine", "restaurant"], "author": "Dai", "link": "https://cooking.stackexchange.com/questions/120433/why-do-north-american-chinese-restaurants-advertise-we-use-100-vegetable-oil", "content": "\nI was reading my local Chinese take-out's menu that somehow ended up stuck to my fridge door and I noticed under their logo a marketing bullet-point advertising:\n\n\nWe use 100% Vegetable Oil\n\n\nThat sounded unusual to me - and it's unhelpfully vague too: doesn't that include olive oil, avocado oil, peanut oil (-ish?), canola oil, etc.\nI searched for the phrase on Google, but but a broken search result page, so I used Bing and saw that over 48,000+ web-pages use this stock phrase.\n\n\n\nSo what is \"vegetable oil\", exactly, and why do so many North American-Chinese restaurants advertise it so frequently? If a restaurant does not use vegetable oil what does that imply about the restaurant?\n"},
{"title": "Would increasing the stability of nuclei have other side effects than just fission not happening?", "tag": ["science-fiction", "nuclear"], "author": "Gensys LTD", "link": "https://worldbuilding.stackexchange.com/questions/228955/would-increasing-the-stability-of-nuclei-have-other-side-effects-than-just-fissi", "content": "\nI'm writing a short story where humanity lives in a section of the universe that's causing the nuclei to be unstable.\nTo explain what I mean, we here have hydrogen, deuterium and tritium where hydrogen and deuterium is stable and tritium is unstable and has a half-life of 12 years.\nI would like the rest of the universe to have eg. tritium be stable and only hydrogen-4 be unstable with a 2000y half-life instead. Similarly have all the elements have more (in most cases many more) isotopes and be remarkably stable even in the very bottom of the periodic table (and possibly have one more row there too).\nWhile increasing stability of the known elements might just shift the \"unstable section\" of the periodic table further down, I'm unsure if the new, heavier fissible elements would even happen.\nSo are there any other effects this would have on the universe? I'm thinking big stuff like stars not happening, planets not able to have a molten cores or stuff like that.\nI know I need to handwave the source of that effect but I'd like to handwave as little as possible\nThanks,\n"},
{"title": "Why does a function has to be differentiable so many times to be considered smooth?", "tag": ["smooth-functions"], "author": "Ian Ambrose", "link": "https://math.stackexchange.com/questions/4436412/why-does-a-function-has-to-be-differentiable-so-many-times-to-be-considered-smoo", "content": "\nI'm studying \"Smoothness\".\nIf a function is once differentiable for all x's, shouldn't it be considered smooth? Because it does \"look smooth\" for all f(x), there's no way it will have sharp corners or cusps because it's differentiable. Then why is it has to be differentiable way more times than once, and actually has to be differentiable infinite times, to be considered smooth?\nOr unless this is not about \"looking smooth\" but smooth in other meaning?\nAny help is greatly appreciated!\nEdit: Sorry. Please use a bit less formal math language so I can understand. I not very good at it.\n"},
{"title": "Sailing from north east Russia to Pakistan in a straight line", "tag": ["geography", "oceanography"], "author": "Gandalf", "link": "https://skeptics.stackexchange.com/questions/53234/sailing-from-north-east-russia-to-pakistan-in-a-straight-line", "content": "\nI found this map from this substack, World in motion:\n\nRohan Chabukswar and Kushal Mukherjee, a pair of researchers at the\nUnited Technologies Research Center in Cork, plotted the route in 2018\nin response to a question posed by Live Science. They worked out that,\nif you set off from the coast of Pakistan, it would be possible to\nsail for nearly 20,000 miles – between Africa and Madagascar, narrowly\nmissing the coast of South America – before hitting land again in the\nfar north east of Russia.\nAnd although it looks like a curve on a two-dimensional map, your\ntheoretical boat would actually be sailing in a completely straight\nline.\n\n\nIt claims you can sail from north east Russia to Pakistan in a straight line. How is this true?\n"},
{"title": "Drawing lines that overlap inside the perimeter using QGIS", "tag": ["qgis", "symbology", "line", "print-composer", "overlapping-features"], "author": "user3733164", "link": "https://gis.stackexchange.com/questions/429732/drawing-lines-that-overlap-inside-the-perimeter-using-qgis", "content": "\nI want to make a map, with two plots. I want to draw them only with a line along the perimeter of each one, with different colour. My problem is that when the lines overlap, only one colour is showed.\nThis is my problem:\n\nThen I want to draw each on with different colour, I would like something like that (without the thin black line):\n\nBut I get this result:\n\nIs there are any way to draw the lines inside the perimeter using QGIS?\n"},
{"title": "What is the maximum distance between two satellites orbiting at 400 km that would still allow them to communicate with each other using radio waves?", "tag": ["orbital-mechanics", "iss", "artificial-satellite", "mathematics", "radio-communication"], "author": "Sarah Williams", "link": "https://space.stackexchange.com/questions/58958/what-is-the-maximum-distance-between-two-satellites-orbiting-at-400-km-that-woul", "content": "\nAll satellites have the same inclination.\nAt an altitude of 400 km, the circumference of their orbit is $2\\pi \\cdot (6371+400) = 42\\ 543$ km.\nIf, for example, you have only 2 satellites separated by half the distance (i.e. 21271 km), will they be able to communicate with each other? I guess not because Earth would be in the way.\nIf we have 3 satellites separated by a third of the distance (i.e, 14000 km), will they still be able to communicate with each other?\nIf the maximum distance is X, how many satellites are needed to cover the whole orbit?\n\n"},
{"title": "Movie with two parallel universes, each of which is a television show in the other's universe", "tag": ["story-identification", "movie", "parallel-universe"], "author": "TylerJNA", "link": "https://scifi.stackexchange.com/questions/262480/movie-with-two-parallel-universes-each-of-which-is-a-television-show-in-the-oth", "content": "\nI didn't expect this to be so difficult to find since it was relatively recent, but my Google searches are turning up nothing but listicles.\nDetails:\n\nMost likely made sometime between 2005 and 2015\nThe two main characters are a female nurse (doctor?) and a male criminal.\nEach of them exists as a fictional TV character in the other's world.\nEventually they meet. I think they somehow interact through their televisions, but I don't recall the details.\n\nI was originally pretty sure that it was English-language, but I don't trust my memory on that.\n"},
{"title": "Is it unethical not to disclose a reduction in travelling costs due to delays when getting reimbursed for business trip?", "tag": ["travel", "reimbursement"], "author": "Sursula -they-", "link": "https://workplace.stackexchange.com/questions/184403/is-it-unethical-not-to-disclose-a-reduction-in-travelling-costs-due-to-delays-wh", "content": "\nI recently had a business trip and used the train to travel. On the way back, there was a significant delay leading to missing a connecting train and as a result, I arrived more than one hour late. When being more than 60 minutes late, the train company will return you 25% of the train fare.\nDue to this being a business trip, I will get reimbursed for the train ticket (which I had to buy myself). If I don't tell my company, they will never know that I got 25% of the return ticket back.\nMy question is: is it unethical not to tell them that there was a delay and I actually payed less than the original price? On the one hand, I would save them money. On the other hand, the trip was approved beforehand (with the original train price) and I was personally inconvenienced by the delay, not the company (as I was travelling back on a saturday, a day on which I normally don't work).\n"},
{"title": "Pinging sound on new radial front wheel", "tag": ["wheels", "spokes", "wheel-truing"], "author": "SSilk", "link": "https://bicycles.stackexchange.com/questions/83640/pinging-sound-on-new-radial-front-wheel", "content": "\nI just installed a new Shimano WH-RS100 radially spoked front wheel. It was purchased new, and the shop checked it for trueness. I think they made one or two small adjustments.\nAfter putting it on my bike, with a freshly pumped tire, I applied the front brake and leaned on the handlebars to check that the tire was pumped sufficiently, and I was surprised to hear a single ping from the wheel. I assume this was a spoke doing something, although what exactly I'm not sure.\nI then rotated wheel about 1/4 turn, and did the same thing, just bouncing my weight down onto the handlebars a couple times. Repeated this around the whole wheel a couple times. I think I got two more pings out of it like that.\nAfter that I went for a short ride, and did more bouncing weight on the front wheel. Again, I think I got one more ping out of the front. Then I did a couple of drops off curbs, with no more pings resulting.\nWhat if anything should I do now?\nDo those pings tell me the wheel has an issue? Or is that just fresh wheel spokes settling in? Or is it from the adjustment at the bike shop settling in?\nDo I need to do anything beyond just checking that the wheel is still true?\nNote: the matching rear wheel, which has a cross-spoke pattern, did not do this when I installed it, although I don't think the local shop made any tweaks on that one.\nI searched for related questions, and found this, which seems to suggest pinging sounds mean the wheel need re-truing.\n"},
{"title": "Geometry Node Extrude Mesh, How to Apply a Material to Random Groups of Extruded Side Faces of a Cube", "tag": ["geometry-nodes", "extrude"], "author": "Xfacter", "link": "https://blender.stackexchange.com/questions/261792/geometry-node-extrude-mesh-how-to-apply-a-material-to-random-groups-of-extruded", "content": "\nfirst time poster and Blender novice here. I am trying to use Geometry Nodes in Blender 3.1.2 to extrude subdivided faces of a cube at random to make something like a Borg Cube. Then, still using geo nodes, I want to apply a glowing/emissive material to randomly chosen \"little cubes\"  on all 4 of their sides (If they are not chosen by the random number generator then I do not want that extrusion to have any glowing faces. This way it makes it look like some of the small cubes can glow on their sides while others cannot glow at all.)\nA quick example image of what I have so far:\n\nThe problem with that image above is that I am simply scattering glowing faces randomly across the sides of the extrusions. They aren't grouped up in any way. I would really like to group them up based on randomly chose top faces but I am having a hard time mapping the effect.\nFor further clarity if my goal doesn't make sense yet:\n\nHere is my node tree so far:\n\nAm I going in the right direction trying to use Transfer Attribute to map the 'Side' output of the Extrude Mesh node to a randomized index of the cube's faces?\nIs there something wrong with my Index node? Multiplying by it seems to dristribute the emissive material all over, including on my top faces. What nodes should I be using to do this kind of material mapping (if it's possible at all). It seems like I'm just barely missing something and could not find any info on the web after hours of searching and trying all day. I would be so relieved to get some guidance and thoughts.\nLastly, for what it's worth, here is my original node tree set up, with very similar output results as my current:\n\n"},
{"title": "Variable zooms in 2001: A Space Odyssey", "tag": ["stanley-kubrick", "2001-a-space-odyssey"], "author": "Roger Nelson", "link": "https://movies.stackexchange.com/questions/117400/variable-zooms-in-2001-a-space-odyssey", "content": "\n\nTrying to figure out if this shot (23:50) in 2001: A Space Odyssey is a camera movement or a zoom happening. I'm pretty sure it's a zoom but some confirmation would be helpful. For those that are wondering, I'm making a short video essay on Kubrick's zoom technique, and would love to be able to take an example from 2001.\n"},
{"title": "Why can't current change instantaneously in a given inductor?", "tag": ["voltage", "capacitor", "current", "inductor", "energy"], "author": "gvg", "link": "https://electronics.stackexchange.com/questions/617324/why-cant-current-change-instantaneously-in-a-given-inductor", "content": "\nI know the mathematical reason behind this. Given the inductor I-V characteristic we know that:\n\nI understand mathematically that a function which is differentiable must be continuous, but what is the physical reason behind this?\nWe know that current creates magnetic field and that the energy stored in that magnetic field is:\n\nI guess it is pretty much related to the energy somehow, but then what's next, and what is the explanation for this?\nThe same question applies to the voltage of capacitor and energy stored in the electric field in case of a capacitor.\n"},
{"title": "Rotation direction of Pulsars", "tag": ["star", "rotation", "neutron-star", "pulsar", "neutrons"], "author": "Autodidact", "link": "https://astronomy.stackexchange.com/questions/49190/rotation-direction-of-pulsars", "content": "\nPulsars are rotating neutron stars observed to have pulses of radiation at very regular intervals that typically range from milliseconds to seconds. It has a very strong magnetic fields which funnel jets of particles out along the two magnetic poles.\n\nMy question is how Pulsars rotate, clockwise or Anti-clockwise?\n\n"},
{"title": "Hold and let's go!", "tag": ["enigmatic-puzzle"], "author": "Prim3numbah", "link": "https://puzzling.stackexchange.com/questions/115889/hold-and-lets-go", "content": "\nAbel, Dennis & Jack, playful as they are, came up with a puzzle.\n\nI choose a common drink instead of the first vitamin. (6)\nI choose the sound of a pirate instead of energy and adds an alien at the end. (6)\nI choose a common drink which takes the lead and make a small change to make it masculine at the end. (5)\nWhat are we?\n"},
{"title": "What might I do about the 1/4 to 3/4\" gaps at the edges of my blacktop driveway?", "tag": ["driveway", "asphalt"], "author": "Yehuda_NYC", "link": "https://diy.stackexchange.com/questions/248244/what-might-i-do-about-the-1-4-to-3-4-gaps-at-the-edges-of-my-blacktop-driveway", "content": "\nThe driveway is relatively new (2-3 years old). The installer did not provide a new foundation and the driveway is now sinking in places. How might I fix the gaps at edges of my home's blacktop driveway?\n\n"},
{"title": "Is there a configuration of 5 points on the plane where any two can be covered by an axis aligned rectangle?", "tag": ["co.combinatorics", "discrete-geometry", "ramsey-theory"], "author": "aradarbel10", "link": "https://mathoverflow.net/questions/421100/is-there-a-configuration-of-5-points-on-the-plane-where-any-two-can-be-covered-b", "content": "\nI'm trying to figure out the question in the title for a project that I'm working on.\nMy goal is to find a configuration of five integer points on the plane, where we can overlap any pair of them without it covering the other three points.\nFor $n=2$ it's trivial, for $n=3$ I believe any acute triangle works.\n$n=4$ is slightly trickier, but still easily solvable:\n\nUnfortunately $n=5$ is exactly where I'm stuck on. From some doodling around it seems impossible, but maybe I'm missing something. It feels like any configuration of four will be  equivalent to the one above, and I don't think there's any way to add another point to it, but I can't tell for sure.\nIf it is possible, what would be the \"smallest\" configuration that satisfies this restriction? In other words, the one with the smallest total bounding box.\nIn case it is not possible, a proof would be nice for closure, but if there's some \"dumb\" way to brute-force this it'd also be ok.\n"},
{"title": "Is there a single verb for what you do in the gym?", "tag": ["word-usage", "word-choice", "word-request"], "author": "Lillatanten", "link": "https://ell.stackexchange.com/questions/314090/is-there-a-single-verb-for-what-you-do-in-the-gym", "content": "\nIn my native language, we have a single verb for what you do in the gym – \"gymma\" – so I was thinking perhaps one could say \"to gym\" in English, but after having checked \"gym\" in a number of dictionaries, I'm convinced this is not possible in English. So, my question now is: is there another verb I could use in English for this exact meaning, or do I have to paraphrase, saying, for instance, \"go to the gym\"? (Annoyingly, \"gymma\" isn't listed in any of the bilingual dictionaries I've checked...)\n"},
{"title": "What was a \"census\" (some sort of compensation) in early medieval Europe?", "tag": ["middle-ages"], "author": "user24096", "link": "https://history.stackexchange.com/questions/68851/what-was-a-census-some-sort-of-compensation-in-early-medieval-europe", "content": "\nWhite (1962):\n\nBy about 745 both monasteries and bishoprics were receiving a census in partial compensation for lost estates.\n\nBrown (2021):\n\nThe formula represents a gift of property to a monastery, in which the donor, his wife, and his heirs retained use rights to the property in exchange for a census.\n\n"},
{"title": "Best Way to Repair Damage to Exterior Door Shell", "tag": ["honda", "door", "body-work", "crv"], "author": "ThaKidd KG5ORD", "link": "https://mechanics.stackexchange.com/questions/88537/best-way-to-repair-damage-to-exterior-door-shell", "content": "\nI am trying to determine the best way to repair some body damage to the exterior door shell on my 2010 Honda CR-V. I took a look at a bunch of YouTube videos on the process but most cover repairing rusted out parts of the body so not sure if that would apply. I am wondering if a bondo repair kit would work such as this one https://www.3m.com/3M/en_US/p/d/b40067474/ or if there is a better product out there to get the job done. Looking to keep costs down from replacing the whole door skin. I am including an image of the damage. Anyone have an opinion on the best route I should take?\n\n"},
{"title": "What is an easy way to transform an equality into a replacement rule", "tag": ["equation-solving", "replacement"], "author": "akozi", "link": "https://mathematica.stackexchange.com/questions/267337/what-is-an-easy-way-to-transform-an-equality-into-a-replacement-rule", "content": "\nI found the necessity for the following procedure and was surprised I couldn't find a built in function to do the following. I include my solution in case someone needs the same functionality, but if there exists a built in feature that I'm not aware of please feel free to share.\nSuppose using Reduce I have created a set of conditions for a system of equations:\n(a == 1 && b == 2 && c == 0)\n\nWhat is an easy way to convert these equalities into a set of replacement rules so that they may be inserted back into an equation?\na + b x + c x^2\n\nI.e. what is a method for converting the set of conditions shown above into the following form?\n{a -> 1, b -> 2, c->0}\n\n"},
{"title": "Need help reading rhythm in Muddy Waters's \"Got my mojo working\"", "tag": ["guitar", "notation", "rhythm"], "author": "james rivers", "link": "https://music.stackexchange.com/questions/122516/need-help-reading-rhythm-in-muddy-waterss-got-my-mojo-working", "content": "\n\nThis is the rhythm guitar part to Muddy Waters's \"Got My Mojo Working\". I would like to know what beats the chords land on for this measure. I only know that the first chord lands on the and of 1. Can someone please help me?\n"},
{"title": "Equations of motion only have a solution for very specific initial conditions", "tag": ["homework-and-exercises", "classical-mechanics", "lagrangian-formalism", "coordinate-systems", "coupled-oscillators"], "author": "jabru", "link": "https://physics.stackexchange.com/questions/705303/equations-of-motion-only-have-a-solution-for-very-specific-initial-conditions", "content": "\nAn exercise made me consider the following Lagrangian\n$$L = \\dot{x}_1^2+\\dot{x}_2^2+2 \\dot{x}_1 \\dot{x}_2 + x_1^2+x_2^2.\\tag{1}$$\nIf I didn't make a mistake the equations of motion should be given by:\n$$2x_1 = 2 \\ddot{x}_1 + 2 \\ddot{x}_2\\tag{2}$$\n$$2x_2 = 2 \\ddot{x}_2 +2 \\ddot{x}_1.\\tag{3}$$\nBut this already implies that\n$$x_1 = x_2. \\tag{4}$$\nSo this equations of motion seem to impose an additional constraint. Moreover, there should not be a solution for initial conditions, where $x_1 \\neq x_2.$ How can it be that the equations of motion already pose a constraint on the initial conditions? Is there some deeper theory behind that as to when this happens? And what does it mean that the lagrangian only has a solutions for very specific constraints?\n"},
{"title": "The Binary Eyes", "tag": ["code-golf", "sequence", "binary"], "author": "LWS SWL", "link": "https://codegolf.stackexchange.com/questions/246492/the-binary-eyes", "content": "\nA binary eye is an odd set of digits, with all of its digits except the center one set to 1 or 0, and the center one set to the opposite of the others. Thus, there are two binary eyes for a given odd number of digits:\n\n\n\n\nx\neyes\n\n\n\n\n1\n1,0\n\n\n3\n101,010\n\n\n5\n11011,00100\n\n\n7\n1110111,0001000\n\n\n9\n111101111,000010000\n\n\n\n\nMake the smallest program possible, in any language, that prints out x number of binary eyes.\nFor example, with an input of two, the program would output\n1,0 and 101,010.\nWith 3 it should output that and the next, and with 4 the next as well, and so on.\nwith 5 it should output the complete table above.\nYou can also have it just continue giving outputs, as long as it outputs only correct outputs, and at least the number of outputs asked for.\n"},
{"title": "Why isn't \"witness\" the third-person singular form in the example sentence?", "tag": ["verbs", "subject-verb-inversion", "third-person"], "author": "xmllmx", "link": "https://english.stackexchange.com/questions/588073/why-isnt-witness-the-third-person-singular-form-in-the-example-sentence", "content": "\nThe Oxford Advanced Learner's Dictionary gives, for the word witness, an example sentence as follows:\n\n(Original Version)\nAuthentic Italian cooking is very healthy —— witness the low incidence\nof heart disease in Italy.\n\nTo me, the sentence should be rephrased as follows:\n\n(My Version)\nAuthentic Italian cooking is very healthy —— as witnessed by the low incidence\nof heart disease in Italy.\n\nSo, I have several questions:\n\nWhat is the subject of witness in the sentence?\n\nWhy isn't witness in the third-person singular form?\n\nCan we take it as an imperative sentence?\n\n\n"},
{"title": "Did Lalo do this to the innocent couple in S6E01?", "tag": ["character", "better-call-saul"], "author": "krish", "link": "https://movies.stackexchange.com/questions/117404/did-lalo-do-this-to-the-innocent-couple-in-s6e01", "content": "\nIn S06E01, we see Lalo going to a couple's home after the events of last season.\nIt seems the couple knows Lalo and offered him coffee and talks with him about how he helped the family. And then we see Lalo catching the scissors as if to kill the woman, but it is not shown, and then it cuts to him going to the bathroom where the women's husband is shaving his beard and he sees him, both laugh and it cuts again. Nothing is shown about them afterward.\nSo did Lalo kill them? If so why when he helped them so much?\n"},
{"title": "Areas of mathematics to strengthen if interested in OR", "tag": ["books"], "author": "AyamGorengPedes", "link": "https://or.stackexchange.com/questions/8297/areas-of-mathematics-to-strengthen-if-interested-in-or", "content": "\nI realize that this question may be off-topic, but I do not know where else can I find a 'social media' where OR practitioners hang out. I am about to finish my math BSc. and about to do my masters. I am interested in learning more OR, so I would like to know which areas of mathematics are the most useful for OR?\nQuestion: Which areas of mathematics should be strengthen in anticipation of doing OR? Strengthen can be understood as learning from a graduate text for subject X in the summer break.\nPersonally,:\n\nLinear Algebra. I haven't touched a more advanced linalg book, but I made a point to try to use it in my thesis. I don't have a more advanced knowledge but I know the undergraduate material pretty intimately by usage.\nAbstract Algebra. Took two courses, covered rigorously groups, rings, and fields.\nGraph theory. Fairly ahead of the standard graph theory classes math and cs students take (did ramsey theory, turan graphs), I just like the subject.\nAnalysis. What you would expect to know of an undergraduate, rigorous single + multivar, rigorous real analysis, somewhat milder complex analysis (half of the class was complex analysis, the other half was intro to measure theory). In fact, I skipped a proper measure theory course, should I take this in my masters?\nProbability, statistics, stochastics. I did a course in each, and I am strong in them, but I don't know if they are that relevant to OR?\n\n"},
{"title": "Giant power meter left/right balance", "tag": ["crankset", "power"], "author": "theonetruepath", "link": "https://bicycles.stackexchange.com/questions/83647/giant-power-meter-left-right-balance", "content": "\nI have a Giant TCR Advanced Pro 0 Disc 2021 which came with the Giant PowerPro power meter built into the cranks.\nI've seen people posting things like, \"Don't take too much notice of the L/R power balance\" which I figure is because they are typically not that accurate.\nBut mine seem awfully consistent in telling me that my right leg is doing exactly 60% of the work on average.\nI've tried updating the firmware, tightening the two crank screws super evenly in small steps to the recommended torque setting and calibrating, after which the readings are exactly the same, 60% on the right leg.\nIs this normal or should I be looking at whether my pedalling really is that unbalanced?\nSome additions, I went for a ride this morning and followed some advice from answers below.\n\nYes it's a two part power meter, one in the middle of the crank arm and one on the drive side spider.\nI put the bike outside for 10 minutes before the ride then calibrated using the Giant app. First half of the ride I averaged 40-60 L-R.\nAt the turn I stopped and tried to calibrate using the Garmin 1050 plus. It said it was happy with the result but I'm pretty sure it did nothing. Power balance unchanged.\nAfter another 10km I stopped again, turned off the Garmin, fired up the Giant app and calibrated again. Suddenly I'm averaging somewhere between 48-52 and 49-51 for the rest of the ride. Also, when applying 300W or more, the left power goes up to 52 to 54%. When I drop under 125W it goes down to 46 to 48%.\n\nSo my conclusions:\n\nCalibration is tricky. Mostly it seems to get it wrong. Now that I have what seems to be a usable calibration I hesitate to change anything until the temperature goes up again next Summer.\nI think that the left power meter may be reading higher than the right under higher load. But I suspect that my left leg is also being lazy under reduced load. The current calibration seems to balance those out a bit. I'm not going to bother doing anything more, unless I happen to find a group with a rider of the right stature (and preferably left handed) to check their power balance on my bike.\n\n"},
{"title": "How would a mermaid jail work?", "tag": ["science-based", "society", "technology", "civilization"], "author": "dsb -", "link": "https://worldbuilding.stackexchange.com/questions/228841/how-would-a-mermaid-jail-work", "content": "\nI'm trying to write a mermaid civilization, although I have one major roadblock when developing a criminal justice system. My mermaids are air breathers (like cetaceans) so I'm not sure how I would have a system of detainment without drowning them to death. How exactly could I get around this hurdle?\n"},
{"title": "Can anybody explain the following circuit?", "tag": ["quantum-gate", "quantum-circuit", "universal-gates"], "author": "Somnus", "link": "https://quantumcomputing.stackexchange.com/questions/26157/can-anybody-explain-the-following-circuit", "content": "\nI think I understand what it does. But i can't agree with output for sertain inputs. For example: if a=1 and b=1 then how the output on 4 line could be xor(a, b). Because as far as I know xor(1,1)=0 and also 1+1=1. It's not consistent.\n\n"},
{"title": "Čech cohomology is isomorphic to singular cohomology", "tag": ["ag.algebraic-geometry", "at.algebraic-topology"], "author": "thrn", "link": "https://mathoverflow.net/questions/421068/%c4%8cech-cohomology-is-isomorphic-to-singular-cohomology", "content": "\nThe singular cohomology with integer coefficients of a projective variety is isomorphic to the Čech cohomology of the constant sheaf of integers on this variety.\nIf the above statement is correct then consider the following example:\nLook at $\\mathbb{P}^1$ and the standard open cover $U_0,U_1$. Then the Čech complex for any sheaf $\\mathcal{F}$ on $\\mathbb{P}^1$ would be\n$$\n0 \\rightarrow  \\mathcal{F}(U_0)\\oplus\\mathcal{F}(U_1) \\rightarrow \\mathcal{F}(U_0\\cap U_1) \\rightarrow 0.\n$$\nIf we consider the constant sheaf of integers this becomes\n$$\n0 \\rightarrow  \\mathbb{Z}\\oplus\\mathbb{Z} \\rightarrow \\mathbb{Z} \\rightarrow 0\n$$\nwith non-trivial map $(a,b)\\mapsto a-b$.\nBut the singular cohomology of $\\mathbb{P}^1$ is\n$$H^i\\mathbb{P}^1=\\begin{cases} \\mathbb{Z},\\quad i=0,2 \\\\\n0,\\quad \\text{else.}\\end{cases}$$\nWhere am I going wrong?\n"},
{"title": "Precautions against sleepwalking danger", "tag": ["sleep", "safety"], "author": "NL_Derek", "link": "https://parenting.stackexchange.com/questions/42559/precautions-against-sleepwalking-danger", "content": "\nHaving read on internet that 15–30% of kids sleepwalk at least once, I recommended my daughter to close the staircase fence when my (now 3-year-old) granddaughter sleeps; her bedroom is on the first floor and she could fall down the stairs. My daughter says she does not think the fence is necessary. The granddaughter is normal and healthy with good sleep patterns, and the mother has a good bedtime ritual (read a story, play a simple game). Should I press the point or let it go? I don't think it would cause a great quarrel, my daughter would follow my advice \"just to stop grandad from grumbling\". However I know my daughter and she might not close the fence every time; not as rebellion, but from laziness or thoughtlessness.\nNow my dilemma: what if the worst comes to the worst and granddaughter does fall down the stairs? If I insist now, my daughter will feel guilty (I shall do my best not to say \"I told you so\" but she will obviously draw conclusions). If I don't insist now, then I shall feel guilty.\nSo, should I insist?\n"},
{"title": "Beethoven driven mad by voice from future", "tag": ["story-identification", "short-stories", "timeline"], "author": "PotatoCrisp", "link": "https://scifi.stackexchange.com/questions/262510/beethoven-driven-mad-by-voice-from-future", "content": "\nShort story in which a student of music uses some sort of an audio time machine to speak across time to Beethoven. He wants to the ask the famous composer why he didn't finish his last work.\nBeethoven was deaf so experienced this as a more particularly disturbing hallucination. It affected his sanity and he was unable to finish his current work.\nSubsequent iterations mean he gave up composing sooner and sooner and so wrote fewer and fewer pieces. He eventually disappeared as an historical figure.\nI read this when I was at school, I think. 1970s, presumably from the school library thus old.\n"},
{"title": "Do the laws of war cover misinformation and psychological warfare?", "tag": ["laws-of-war"], "author": "curiouser", "link": "https://law.stackexchange.com/questions/79644/do-the-laws-of-war-cover-misinformation-and-psychological-warfare", "content": "\nOn April 22nd 2022, the state-owned Rossiya 1 TV channel (which is widely seen as a Kremlin mouthpiece) reported that British prime minister Boris Johnson had \"threatened to carry out a nuclear strike against Russia, if needed, without consulting Nato\". The British prime minister's press office has denied he ever said such a thing. As far as I can find from press sources, this was not a (wilful) misinterpretation or mistranslation of anything he said, but simply a made-up quote.\nThis made me wonder, do the laws of war say anything about misinformation or psychological warfare? Is it e.g. a war crime to claim that the political or military leaders of the country you are at war with have ordered their troops to surrender, in order to mislead those troops? Is it a war crime to lie about the actions and declared intentions of your enemy to motivate your own troops? Is there in fact anything that binds a country at war to factual representation of their own and their enemy's actions, declarations, capabilities and intentions?\n"},
{"title": "Should I correct a mistake for the camera-ready version even though the reviewers missed that mistake?", "tag": ["publications", "conference"], "author": "def anonymous", "link": "https://academia.stackexchange.com/questions/184572/should-i-correct-a-mistake-for-the-camera-ready-version-even-though-the-reviewer", "content": "\nSo the mistake is not a major bug, the contributions of the paper remain the same, but still, I feel it was a silly statistical error. Can I correct it, even if the reviewers missed catching it?\n"},
{"title": "Do creatures age at the pace of the creature they've shapeshifted into?", "tag": ["dnd-5e", "dungeons-and-dragons", "shapeshifter", "aging"], "author": "Cat of doom2", "link": "https://rpg.stackexchange.com/questions/197942/do-creatures-age-at-the-pace-of-the-creature-theyve-shapeshifted-into", "content": "\nIf a dragon, or really anything, was to shape shift into an animal with a different aging rate, would the dragon (or other creature) age at their age rate?\nFor example, humans age about 10 times faster than a dragon, so if a young red dragon was to turn into a human, would they age 10 times faster? Would they age at all? Most importantly, could the age difference be used theoretically skip life stages to a stronger one if a dragon or whatever creature wanted to?\nI'd most appreciate D&D 5e, but if other editions are required to explain it, that is fine.\n"},
{"title": "Why does Job say 'shall I return there' in Job 1:21?", "tag": ["word-study", "authorial-intent", "job"], "author": "Andries Stander", "link": "https://hermeneutics.stackexchange.com/questions/75915/why-does-job-say-shall-i-return-there-in-job-121", "content": "\nIn Job 1:21 we read:\n\nAnd said, Naked came I out of my mother's womb, and naked shall I return thither: the Lord gave, and the Lord hath taken away; blessed be the name of the Lord. (KJV)\n\nWhat I want to know is why he uses this 'term' refering to his mother's womb. Is there a nuanced meaning here that one needs to be aware of? Is this a precursor to him 'cursing his day' in chapter 3?\n"},
{"title": "Dental insurance isn't really a type of insurance?", "tag": ["united-states", "health-insurance"], "author": "Kevin Kostlan", "link": "https://money.stackexchange.com/questions/150582/dental-insurance-isnt-really-a-type-of-insurance", "content": "\nThe central tenet of insurance is to pay slightly more on average while getting protected from paying very large amounts of money should disaster strike. In essence it's paying a premium to lower risk. A large company can pool risk, so it doesn't feel the effects of a small number of i.e. houses being burned down by a wildfire in California.\nFrom this link, it's very common for dental insurance to have quite low annual maximum benefits in the $1000 range, in addition to a lifetime maximum. But major dental procedures with surgery can cost much more. The companies are very large risk pools, so they only care about average cost like most insurance companies. This means the only reason they impose benefit limits is because not doing so would significantly add to the average cost. Thus, a substantial fraction of dollars spent are spent beyond this limit.\nThis leaves two questions:\n\nWhy are companies passing on so much risk to individuals, when they don't do so for other types of insurance such as houses that can cost upwards of a million?\nWhy pay for insurance in first place if it can't protect you from the risk of very expensive procedures?\n\n"},
{"title": "How to pass on research posthumously", "tag": ["soft-question", "journals", "advice"], "author": "Kirk", "link": "https://mathoverflow.net/questions/421031/how-to-pass-on-research-posthumously", "content": "\nI've been independently researching math, for a while in the homeless community. While I am generally safe, situational realities (weather, equipment stress, health and especially how cities can discard possessions) are weighing on me more heavily as I prepare to publish work. I have as much on paper as digitally, and I'm working on getting notebooks photographed.\nWhat is a responsible/automatic way, should I (e.g.) die suddenly, to pass on research work? I'm a bit unusual in the sense that people don't understand why I'm homeless (so...more isolated, I have no peers it would be responsible to use), and it seems dubious a university would take me -- an unknown -- seriously.\nI know, e.g., that gmail can transfer ownership to another entity after an inactivity timer expires, but that could easily go wrong. A lawyer doesn't make sense; I have no estate and the city would get my stuff first.\nI'm not concerned about credit as much as passing on the work. Collaboration could work; I just don't know how to escrow / dead-man switch this so someone actually sees it.\n"},
{"title": "The silhouette of a hand holding a cylindrical glass jar, in the background is the Milky Way", "tag": ["visual", "odd-one-out"], "author": "Veedrac", "link": "https://puzzling.stackexchange.com/questions/115879/the-silhouette-of-a-hand-holding-a-cylindrical-glass-jar-in-the-background-is-t", "content": "\nElsewhere, a game was played. This game was an unusual sort of game, and the results are an unusual sort of curiosity, though I should say no more outside of spoiler tags. I thought it would make for an interesting puzzle, so am cross-posting it here with some details hidden.\nHere are some pictures. Find the odd one out.\n\n\n\n\n\n\nYou should be able to solve this problem with visual inspection alone, without the use of analysis tools or internet searches.\nHint:\n\n The answer to this is going to surprise most people in the world. You should still be able to look at the images, see something suspicious about them, and deduce that something is going on. There is more than one suspicious property you should be looking for.\n\n\n These images are in a random order and do not encode anything. One of them is just qualitatively different to the others.\n\n\n The scene depicted is largely arbitrary. The suspicious properties in the images were not intentional.\n\nAttribution spoilers (this is not a hint):\n\n Most of these images are generated by DALL-E 2.\n\n DALL-E 2 adds a signature to the bottom right corner of each image, which I censored in order to prevent the game being given away.\n\n\n Prompts, generations, and the odd one out come from this thread.\n\n\n Here is a post with all of the prompts and their results.\n\n"},
{"title": "How do you deal with disrepectful/angry coworker?", "tag": ["communication", "colleagues", "conflict", "conflict-resolution"], "author": "vbvcgfgfdgsdfs", "link": "https://workplace.stackexchange.com/questions/184414/how-do-you-deal-with-disrepectful-angry-coworker", "content": "\nI wanted to get your opinion on something that happened today at work.\nI'm a manager in a tech company. Since friday, we have this \"defcon 3\" situation at work, meaning that we have some production problems that need to be solved. But it's not so critical / urgent and basically 95% of tech workers in the company continue to work as usual. People can be asked to join the work to troubleshoot the issue but usually it's not really mandatory unless you are the only persone knowing technology X related to the issue.\nToday I'm doing a 1-1 meeting with one of my report in the corner of the open-space, and some manager comes in. Without asking about interrupting, saying hello etc, he just says quite agressively \"you find me some people to work for the DEFCON 3\". I'm like, what, and I tell him that they'll join the work on it if they want to work on it. He replies that since it's DEFCON3 it's mandatory that some people work on it. I tell him ok, I'm in the middle of my 1-1 meeting, we'll discuss this later. Then he refuses to leave telling me that DEFCON3 \"trumps\" 1-1 meeting and it's more important, visibly quite annoyed/agitated. After telling him several times that I'll finish my 1-1 and that I'll see afterwards, he leaves but quite angrily.\nAfterwards, I was at lunch with other coworkers, around 10 or so. The same manager comes in in front the tables, and stars shouting angrily \"When I ask for people for DEFCON3, I ask for people for DEFCON3! It's not optional to come and help\". People were quite surprised / annoyed at this behavior especially during lunch pause.\nThis manager isn't even in my reporting line, nor is he \"officially\" the person that evens manage this DEFCON3 thing, so I dont even think he has any authority to request people to work with him for no real reason.\nWhat do you think I should do in this situation ? I find it very \"humiliating\" to be disrespected like this, especially in front of my report. I think I was able to keep cool but otherwise given how angry/agitated he was, this would have turned into a full-on shouting match in the office\nShould I try to talk to him privately ? To my manager ? To his manger ?\n"},
{"title": "How are fonts \"stored\" on LaTeX?", "tag": ["fonts", "fontsize"], "author": "Choripán con pebre", "link": "https://tex.stackexchange.com/questions/642059/how-are-fonts-stored-on-latex", "content": "\nI used a humongous letter (the font was \\mathscr) on a document and I was shocked by the quality of the letter despite the size of the letter. How are all these details stored? Why does the letter not look pixelated after a certain point? This might be very basic but I have no background whatsoever on whatever area this question belongs to.\n"},
{"title": "Convert to uppercase, except for escaped characters", "tag": ["bash", "escape-characters"], "author": "Ocean", "link": "https://unix.stackexchange.com/questions/700336/convert-to-uppercase-except-for-escaped-characters", "content": "\nThe methods I found break things further down the line by also affecting linebreaks.\nFor example...\n$ message=\"First Line\\nSecond Line\"; \n$ echo \"${message^^}\"\nFIRST LINE\\NSECOND LINE\n\nIs there an elegant way to convert a string to uppercase, but leaving escaped characters alone, to get the following output instead?\nFIRST LINE\\nSECOND LINE\n\nI could just do something convoluted like changing \"\\n\" to 0001 or something along those lines, apply the conversion and then return 0001 to \"\\n\". But maybe there is a better way.\n"},
{"title": "Mathematical Olympiad question (complex variable)", "tag": ["complex-analysis", "complex-numbers", "contest-math"], "author": "Lord Vader", "link": "https://math.stackexchange.com/questions/4436394/mathematical-olympiad-question-complex-variable", "content": "\nI found this question in an old Mathematical Olympiad:\n\nLet $0<a<1$ be a real number, and let $f(z)$ be a complex polynomial such that $$|f(z)|\\leq \\frac{1}{|z-a|}$$ on the unit disk $|z|\\leq 1$. Prove that $$|f(a)| \\leq \\frac{1}{1-a^2}.$$\n\nMy attempt: Since $f$ is analytic in $\\{z\\in\\mathbb{C}:|z|\\leq 1\\}$, we have that $$|f(a)| \\leq \\max_{|z|=1}|f(z)|.$$ Because of the triangle inequality, for all $z\\in \\mathbb{C}$ with $|z|=1$ we have $$|z-a|\\geq |z|-a = 1-a.$$ By applying the hypothesis, we get $$|f(a)| \\leq \\max_{|z|=1}|f(z)| \\leq \\max_{|z|=1}\\frac{1}{|z-a|}\\leq \\frac{1}{1-a}.$$ Nevertheless, we know that $1-a^2>1-a$ since $a\\in (0,1)$. Therefore, we cannot get the desired result from the above inequality.\nWhat can I apply to complete the proof?\n"},
{"title": "Insert a dynamic vector into a matrix", "tag": ["list-manipulation", "matrix", "array", "sparse-arrays"], "author": "qahtah", "link": "https://mathematica.stackexchange.com/questions/267376/insert-a-dynamic-vector-into-a-matrix", "content": "\nIf I have the following dynamic vector\n   Cs[NN_] := \n Table[{Sin[(2*i - 1) τ], Sin[(2*i - 1) τ]}, {i, 1, NN}]   // \nFlatten\n\nThe size of Cs depends on the integer NN. I want to construct a bigger matrix which has the following format:\nSmat[NN_] := {{Cs[NN], 0, 0, 0, 0, 0},\n          {0, Cs[NN], 0, 0, 0, 0},\n          {0, 0, Cs[NN], 0, 0, 0},\n          {0, 0, 0, Cs[NN], 0, 0},\n          {0, 0, 0, 0, Cs[NN], 0},\n          {0, 0, 0, 0, 0, Cs[NN]}}\n\nPlease note the size (number of rows and columns) of Smat depends on the size of Cs. How can I construct Smat automatically?\nI appreciate your help in this regard.\n"},
{"title": "How do I efficiently find which elements of a list are in another list?", "tag": ["python", "list", "for-loop", "vectorization"], "author": "herdek550", "link": "https://stackoverflow.com/questions/71990420/how-do-i-efficiently-find-which-elements-of-a-list-are-in-another-list", "content": "\nI want to know which elements of list_1 are in list_2. I need the output as an ordered list of booleans. But I want to avoid for loops, because both lists have over 2 million elements.\nThis is what I have and it works, but it's too slow:\nlist_1 = [0,0,1,2,0,0]\nlist_2 = [1,2,3,4,5,6]\n\nbooleans = []\nfor i in list_1:\n   booleans.append(i in list_2)\n\n# booleans = [False, False, True, True, False, False]\n\nI could split the list and use multithreading, but I would prefer a simpler solution if possible. I know some functions like sum() use vector operations. I am looking for something similar.\nHow can I make my code more efficient?\n"},
{"title": "Did Florida reject all K-5 maths books except ones by a colleague's ex-employer?", "tag": ["politics", "education"], "author": "Paul Johnson", "link": "https://skeptics.stackexchange.com/questions/53238/did-florida-reject-all-k-5-maths-books-except-ones-by-a-colleagues-ex-employer", "content": "\nThis article alleges that the only books approved by Governor Ron DeSantis and the Florida Department of Education were published by \"Accelerate Learning\", a company which happens to have employed fellow Republican Governor Glen Youngkin:\n\nThe Carlyle Group, a global investment firm, acquired Accelerate Learning on Dec. 20, 2018, according to the firm's website.\nDuring that time, Virginia Gov. Glenn Youngkin was the co-CEO of the firm. After 25 years with the company, Youngkin resigned in 2020 to run for office in Virginia.\n\nIs it true that Accelerate Learning is now the only permitted supplier of K-5 Maths textbooks in Florida?\n"},
{"title": "What is The Most Probable Way The USA Can Become A Dictatorship?", "tag": ["politics", "government", "geopolitics", "united-states"], "author": "SmartBulbInc", "link": "https://worldbuilding.stackexchange.com/questions/228979/what-is-the-most-probable-way-the-usa-can-become-a-dictatorship", "content": "\nI'm world-building a future where the USA devolves into a fascist state ruled by a single dictator.\nThe following are true:\n\nThe dictator in question is a charismatic populist who is highly\nintelligent, wealthy, and well-connected.\n\nThe dictator takes power via a non-violent coup and is able to get the\nmilitary to swear personal loyalty to him.\n\nThe dictator gains full control of the country through\nentirely legal means. At no point does he ever exploit legal-loopholes or gain support none-legitimately.\n\n\nWith all that being said, what is the most probable way that the USA can devolve into a dictatorship?\n"},
{"title": "How to graph a solid common to multiple functions", "tag": ["graphics3d"], "author": "Arnold", "link": "https://mathematica.stackexchange.com/questions/267312/how-to-graph-a-solid-common-to-multiple-functions", "content": "\nI want to be able to graph the solid that is contained by two functions.  I am graphing x^2+z^2=400 and y^2+z^2=400 and this the code I used and the graph I got:\n    Plot3D[{z = Sqrt[400 - x^2], z = Sqrt[400 - y^2], z = -Sqrt[400 - x^2],\n    z = -Sqrt[400 - y^2]}, {x, -50, 50}, {y, -50, 50}]\n\n\nI was wondering how I could graph the solid common to the cylinders aka the solid that the cylinders form.\n"},
{"title": "What was German torpedo's problem discovered in 1942?", "tag": ["world-war-two", "naval", "ww2-european-theater", "submarine"], "author": "totalMongot", "link": "https://history.stackexchange.com/questions/68857/what-was-german-torpedos-problem-discovered-in-1942", "content": "\nI am reading a book about Otto Kretschmer, and the author speaks about a problem of German torpedoes.\nThe only thing said in the book is:\n\nTorpedoes needed to be ventilated during some time because hydrogen was expelled from the propulsion system. This led to a problem only discovered in 1942\n\nHowever the author does not explain what the problem is exactly. Anyone has any hindsight on that?\n"},
{"title": "Pros/Cons of 3D printed part cooling mods", "tag": ["print-fan"], "author": "agarza", "link": "https://3dprinting.stackexchange.com/questions/19291/pros-cons-of-3d-printed-part-cooling-mods", "content": "\nIn my previous research for mods for my Ender 3v2, I came across the topic of part cooling mods. The two most common are the Petsfang and Hero Me sets.\n\nWhat are the pros and cons of third-party/DIY part cooling mods?\n\nWhat benefit does having a third-party/DIY part cooling mod provide?\n\n\n"},
{"title": "TikZ: Shading a stripped ball", "tag": ["tikz-pgf"], "author": "Bubaya", "link": "https://tex.stackexchange.com/questions/641981/tikz-shading-a-stripped-ball", "content": "\nI want to have a stripped ball with 3-D shading. My attempt\n\\documentclass{scrartcl}\n\\usepackage{tikz}\n\\begin{document}\n\\begin{tikzpicture}\n        \\shade[shading=ball, ball color=green!60] (0,2) arc (90:-90:2) arc (-90:90:1.2 and 2);\n        \\shade[shading=ball, ball color=red!60] (0,2) arc (90:-90:-2 and 2) arc (-90:90:-1 and 2);\n        \\shade[shading=ball, ball color=blue!60] (0,2) arc (90:-90:-1 and 2) arc (-90:90:1.2 and 2);\n\\end{tikzpicture}\n\\end{document}\n\nobviously has a big flaw:\n\nI would need to make the position of the light spot the same for all three segments. How can I achieve that?\n"},
{"title": "Why does the default base64 encoding use forward slash /?", "tag": ["internet", "character-sets", "encoding"], "author": "DeusXMachina", "link": "https://retrocomputing.stackexchange.com/questions/24394/why-does-the-default-base64-encoding-use-forward-slash", "content": "\nAs anyone who has been bitten by using base64 instead of base64url  is quite well aware, the \"original\" base64 alphabet uses alphanumeric, +, = (both perfectly cromulent URL characters), and the dreaded /. I want to know how this came about, because it seems that using / in an encoding alphabet is extremely short-sighted.\nI have been able to track the origin of this through:\n\nRFC4648, which points to\nRFC3548, which points to\nRFC1421, at which point, the base64 trail goes cold.\n\nWe can however look to RFC821, the famous Simple Mail Transfer Protocol (SMTP). There is no mention of base64 encoding, or any binary-to-text encoding for that matter. I'm not even sure the idea of attaching/sending binary data via email existed at the time, and it wasn't until 1992 that the first MIME email attachment was sent.\nRegardless, all the folks working on this sort early tech of were surely familiar with UNIX to some degree, and the convention of using / for path separation. Further, the use of the / symbol as a separator of the form \"something / something_else\" goes way back, probably to the 18th century at least. I'm guessing this usage is probably what subconsciously influence the choice of / as the UNIX path separator. Surely, one might consider the idea of base64blob1/base64blob2. All this put together makes / a really strange choice for the fledgling base64 encoding alphabet, even in a pre-URL age,  especially since better alternatives like - and _ are right there. Heck, even ,.@!$&% are all better candidates than / in my book. / is literally the only character besides \\0 disallowed in UNIX filenames.\nSo how did this come about?\n"},
{"title": "What would it mean if a circuit board all of a sudden works after it doesn’t work for some time?", "tag": ["short-circuit", "hardware", "debugging"], "author": "TheGamingGiraffe", "link": "https://electronics.stackexchange.com/questions/617340/what-would-it-mean-if-a-circuit-board-all-of-a-sudden-works-after-it-doesn-t-wor", "content": "\nSorry for my noob question. I am very new to debugging hardware circuit boards.\nA circuit board was not working. After measuring a voltage rail it was jumping from 12V to 0V, and back to 12, etc. what kind of behavior does this typically indicate?\nThe board randomly worked by not doing anything besides probing a few areas with a multimeter (it wasn’t working for a few days). How is that possible?\n"},
{"title": "Raspberry PI DPI only works over short distances, why?", "tag": ["gpio", "i2c", "display", "dsi"], "author": "manintree", "link": "https://raspberrypi.stackexchange.com/questions/137217/raspberry-pi-dpi-only-works-over-short-distances-why", "content": "\nI would like to use the Raspberry Pi 3B+ to operate the rectangular Hyerpixel 4.0 touchscreen from Pimoroni. However, I don’t want to plug the touchscreen directly onto the Raspberry Pi, but instead use a 3.5 meter long cable to connect the touchscreen to the Raspberry Pi.\nMy structure is such that I bring the Raspberry Pi to a circuit board using a 40-pin cable. From there I pick up the I2C signal so that I can connect some IO’s on the board. There is also a 40-pin connection on the circuit board, to which I can connect my 3.5 meter cable to the Hyperpixel 4.0.\nWhen I still had the cable connection from the circuit board to the Hyperpixel 4.0 with a 40cm cable, everything worked fine. However, when I replaced the 40cm long cable with the 3.5m, the display only flickered, but the touch still worked. I replaced the 3.5m cable again with the 40cm cable and the image display on the touchscreen still didn’t work. However, if I plug the hyperpixel directly onto the Raspberry Pi header again, everything works again.\nAt first I thought it was the IO board that connects the raspberry pi to Hyperpixel, but replacing this board didn’t help either. I’m at a loss because I don’t know where to start troubleshooting. I hope someone can help me.\nThanks in advance\n"},
{"title": "How can I propagate const when returning a std::vector<int*> from a const method?", "tag": ["c++", "const-correctness"], "author": "kovarex", "link": "https://stackoverflow.com/questions/71997744/how-can-i-propagate-const-when-returning-a-stdvectorint-from-a-const-method", "content": "\nLets show it in an example where we have a Data class with primary data, some kind of index that points to the primary data, and we also need to expose a const version the index.\nclass Data\n{\npublic:\n  const std::vector<int>& getPrimaryData() const { return this->primaryData; }\n  const std::vector<int*>& getIndex() const { return this->index; }\nprivate:\n  std::vector<int> primaryData;\n  std::vector<int*> index;\n};\n\nThis is wrong, as the user can easily modify the data:\nconst Data& data = something.getData();\nconst std::vector<int*>& index = data.getIndex();\n*index[0] = 5; // oups we are modifying data of const object, this is wrong\n\nThe reason of this is, that the proper type the Data::getIndex should be returning is:\nconst std::vector<const int*>&\n\nBut you can guess what happens when you try to write the method that way to \"just convert the non-const variant to const variant\":\n// compiler error, can't convert std::vector<int*> to std::vector<const int*> these are unrelated types.\nconst std::vector<const int*>& getIndex() const { return this->index; }\n\nAs far as I know, C++ doesn't have any good solution to this problem. Obviously, I could just create new vector, copy the values from the index and return it, but that doesn't make any sense from the performance perspective.\nPlease, note that this is just simplified example of real problems in bigger programs. int could be a bigger object (Book lets say), and index could be index of books of some sort. And the Data might need to use the index to modify the book, but at the same time, provide the index to read the books in a const way.\n"},
{"title": "Is it a coincidence the circumference of Earth in kilometers is almost 2 to the 12th?", "tag": ["geodesy"], "author": "LMol", "link": "https://earthscience.stackexchange.com/questions/23762/is-it-a-coincidence-the-circumference-of-earth-in-kilometers-is-almost-2-to-the", "content": "\nThe circumference of Earth has been measured to be 40,075km, which is only 21km from $40,096=2^{12}$. For reference, $40,075≈2^{11.992}$. This is probably a strange coincidence, but originally a meter was set to be $1/10,000,000$ of the distance from the north pole to the equator, so maybe there is a mathematical explanation.\n"},
{"title": "Being undermined as a TA over grading", "tag": ["teaching-assistant", "grading"], "author": "LoopyStrings", "link": "https://academia.stackexchange.com/questions/184539/being-undermined-as-a-ta-over-grading", "content": "\nI have marked several writing assignments for this course and the grade grubbing from this cohort was unlike anything I’ve ever experienced as a TA.\nThe primary instructor and I were given a heads up from the previous semesters instructors and therefore we established some ground rules between us.\n\nstudents wishing to discuss grades were to email me since I do all the marking.\nI would review the requests for regrading and unless an egregious error occurred I wouldn’t change the grade.\nall requests beyond that are to go to the faculty for a formal remark and that grade is final.\n\nOn the third and final paper. A student emailed the primary prof and not me to complain about their grade. They argued every other grade unsuccessfully this semester. The primary prof. Cc: me and asked the student to reach out to me which they never did. Today as I was finalizing. I noted that the grade had been changed by primary prof and added 10% even though their policy was no grade change and by the rubric they had earned their other grade.\nI feel really undermined especially since the agreement between us was to talk to me. It only makes it worse that this student was atrocious to me in office hours and didn’t even want help improving their papers. Just to yell at me for their grade.\nI’m not really sure how to talk to the prof about this when these were their own rules she broke.\nUpdate: spoke with prof. Turns out the student responded to just them after that cc. And that I told them to “speak with prof” — all of which did not happen. So the student lied and grade grubbed the primary prof.\nThe grades have now been submitted and the primary prof has decided it’s not a fight they want to take up about the lying.\n"},
{"title": "Is it fair to not transliterate non-English sources in the bibliography?", "tag": ["citations"], "author": "Niranjan", "link": "https://academia.stackexchange.com/questions/184524/is-it-fair-to-not-transliterate-non-english-sources-in-the-bibliography", "content": "\nI am a student of linguistics who works on Marathi. A lot of literature on this topic is available in Marathi language which uses the Devanagari script, but in the academic literature, I have seen many researchers transliterating the original title, author name in the Latin script (with English conventions) e.g.,\n\nDamle, Μ. K. 1970 Shastriya Marathi VyaakraN [A scientific grammar of Marathi]. K. S. Arjunwadkar. Pune, India: Deshmukh & Company.\n\nfor\n\nदामले, मो. के 1970 शास्त्रीय मराठी व्याकरण [A scientific grammar of Marathi]. कृ. श्री. अर्जुनवाडकर. Pune, India: Deshmukh & Company.\n\nI personally don't like this practice. Here's why.\n\nIt's not about the pronunciation at all. If it really was, people would have got uncomfortable with Jean, a French name too as it should have been John as per the English conventions. I always used to mispronounce it as jeen from jeans without the s ([ʤiːn] in IPA). This clearly means that people are just not happy to see a script other than Latin in academic writing which I feel is very unjust in a multicultural and multilingual world.\nIf I am citing a work in a language other than English anyways the reader will have to read it in that language. If they don't know the language, they will probably need a translator for accessing the work. So anyways just transliterating the title is not going to help them in any ways.\nIf a reader knows that particular language, then it is even annoying for them because there is no \"universal\" transliteration scheme available. Different researchers follow different conventions without even giving the rules for parsing them. It obstructs the reading of the person who is actually able to read it without any aid and comprehend the language in which the source is written on the cost of the so called \"comfort/convenience\" of a person who is not able to (or probably going to) read the actual source.\n\nCan we just start getting comfortable with scripts other than Latin in the bibliography?\n"},
{"title": "Is there a mistake in solving this limit?", "tag": ["limits", "limits-without-lhopital"], "author": "Tyke", "link": "https://math.stackexchange.com/questions/4436390/is-there-a-mistake-in-solving-this-limit", "content": "\nI want to solve this:\n\\begin{equation}\nL=\\lim_{x\\rightarrow 0}  \\frac{\\sum\\limits_{m=1}^{M}a_{m}\\exp\\left\\{\\frac{bm^2}{ (m^2+2x^2)x^2}\\right\\}{(m^2+2x^2)^{-3/2}} }   {\\sum\\limits_{m=1}^{M} c_{m}\\exp\\left\\{\\frac{bm^2}{ (m^2+2x^2)x^2}\\right\\}{(m^2+2x^2)^{-3/2}}}\n\\end{equation}\nwhere\n\\begin{equation}\n\\begin{aligned}\nm=1,2,\\cdots,M\\\\\na_m,b,c_m \\neq 0 \\quad \\text{and are all constants}\n\\end{aligned}\n\\end{equation}\nHere is my approach:\nSince $x\\rightarrow 0$, I ignore the term $2x^4$ in the denominator of $\\exp\\left\\{\\frac{b_m}{ (m^2+2x^2)x^2}\\right\\}$ and I get:\n\\begin{equation}\n\\begin{aligned}\nL&=\\lim_{x\\rightarrow 0}  \\frac{\\exp\\left\\{\\frac{b}{x^2}\\right\\}\\sum\\limits_{m=1}^{M}a_{m}{(m^2+2x^2)^{-3/2}} }   {\\exp\\left\\{\\frac{b}{x^2}\\right\\}\\sum\\limits_{m=1}^{M} c_{m}{(m^2+2x^2)^{-3/2}}}\\\\\n&=\\lim_{x\\rightarrow 0}  \\frac{\\sum\\limits_{m=1}^{M}a_{m}{(m^2+2x^2)^{-3/2}} }   {\\sum\\limits_{m=1}^{M} c_{m}{(m^2+2x^2)^{-3/2}}}\\\\\n&=\\frac{\\sum\\limits_{m=1}^{M}\\frac{a_{m}}{m^3} }   {\\sum\\limits_{m=1}^{M} \\frac{c_{m}}{m^3}}\n\\end{aligned}\n\\end{equation}\nMy question is:\n1.Is there a mistakes in my derivation?\n2.If I made mistakes in the derivation, then, what is the correct derivation?\nThanks for helpful comments and answers!\n"},
{"title": "Did Luke use the Force to forcefully lift up the large gate of Jabba's palace?", "tag": ["star-wars", "the-force", "return-of-the-jedi", "jabba-the-hutt"], "author": "user57467", "link": "https://scifi.stackexchange.com/questions/262522/did-luke-use-the-force-to-forcefully-lift-up-the-large-gate-of-jabbas-palace", "content": "\nI have always wondered if Luke Skywalker had used the Force to forcefully lift up the large gate of Jabba's palace, or if he had used the Force to access the door's control unit and manipulated it so that the gate would open.\n\nDid Luke use the Force to forcefully lift up the large gate of Jabba's palace?\n"},
{"title": "I lost files by using the \"mv\" command and I don't know where they are!", "tag": ["linux", "ubuntu", "mv"], "author": "Samuel Cayo", "link": "https://unix.stackexchange.com/questions/700151/i-lost-files-by-using-the-mv-command-and-i-dont-know-where-they-are", "content": "\nI lost some files by using the mv command. I don't know where they are.  They are not in the directory to which I intended to copy them.\nBelow is a transcript of what I did:\nsamuelcayo@CAYS07019906:~/Downloads/221-tp2-public-main$ cd\nsamuelcayo@CAYS07019906:~$ ls\nDesktop  Documents  Downloads  GameShell  Music  Pictures  pratice  Public  Templates  Videos\nsamuelcayo@CAYS07019906:~$ mkdir tp2\nsamuelcayo@CAYS07019906:~$ ls\nDesktop  Documents  Downloads  GameShell  Music  Pictures  pratice  Public  Templates  tp2  Videos\nsamuelcayo@CAYS07019906:~$ cd Downloads/221-tp2-public-main/\nsamuelcayo@CAYS07019906:~/Downloads/221-tp2-public-main$ ls\nbackup  copybash  Dockerfile               ntfy-1.16.0  packets.txt     README.md      restore        secret\ncloud   data      Dockerfile_CAYS07019906  ntfy.zip     rapport-tp2.md  remplacer.sed  sauvegarde.sh  tail\nsamuelcayo@CAYS07019906:~/Downloads/221-tp2-public-main$ mv rapport-tp2.md tp2\nsamuelcayo@CAYS07019906:~/Downloads/221-tp2-public-main$ mv Dockerfile_CAYS07019906 tp2\nsamuelcayo@CAYS07019906:~/Downloads/221-tp2-public-main$ mv packets.txt tp2\nsamuelcayo@CAYS07019906:~/Downloads/221-tp2-public-main$ mv sauvegarde.sh tp2\nsamuelcayo@CAYS07019906:~/Downloads/221-tp2-public-main$ cd\nsamuelcayo@CAYS07019906:~$ cd tp2/\nsamuelcayo@CAYS07019906:~/tp2$ ls\nsamuelcayo@CAYS07019906:~/tp2$ ls -l\ntotal 0\nsamuelcayo@CAYS07019906:~/tp2$ cd ..\n\n"},
{"title": "How is a Bose-Einstein condensate produced from sodium atoms that do not have an integer spin?", "tag": ["quantum-spin", "bose-einstein-condensate"], "author": "Mamoun Ghazali", "link": "https://physics.stackexchange.com/questions/705506/how-is-a-bose-einstein-condensate-produced-from-sodium-atoms-that-do-not-have-an", "content": "\nIn 1995 Wolfgang Ketterle at MIT produced a Bose-Einstein Condensate in a gas of sodium-23 atoms, but sodium-23 doesn't have an integer spin.  How does this work?\n"},
{"title": "Why are there two “is”’s in: Why is yawning is contagious?", "tag": ["grammar", "verbs", "american-english", "clauses"], "author": "Anas Bo", "link": "https://ell.stackexchange.com/questions/313924/why-are-there-two-is-s-in-why-is-yawning-is-contagious", "content": "\nA NY Times article contains this question:\n\nWhy is yawning is contagious?\n\nWhy are there two “is”’s in this sentence?\nSimilarly for these sentence fragments:\n\n... as far as the freak was concerned was ... (source: University of Sheffield)\n\n\nWhen I found out she was a cheapskate was ...\n\nWhat's the purpose of the second verb in those sentences? (”As far as the freak was concerned was”, “When I found out she was a cheapskate was”, “Why is yawning is contagious”)\n"},
{"title": "What reliable source of power is best on a newly colonized interstellar planet?", "tag": ["science-based", "reality-check", "space-colonization", "power-sources", "interstellar"], "author": "TheChosenOnly", "link": "https://worldbuilding.stackexchange.com/questions/228901/what-reliable-source-of-power-is-best-on-a-newly-colonized-interstellar-planet", "content": "\nI have been working on a hard Sci-Fi narrative of a first-time human colonization scenario on an interstellar star system like Alpha-Centauri.\nMy narrative though uses NO FTL drives or other fictional warp technology and instead focuses on realistic interstellar travel. The ship I thought of can travel at 70% of light speed.  It is accelerated using photon laser propulsion on Earth and gets to Alpha Centauri in 6 years. It is powered by a hybrid of fusion and antimatter engines and uses it to decelerate. The ship can carry up to 250 metric tons. It takes place in the year 2200.\n\nIn its cargo section, it carries:\n\nParts for an \"In-Situ Stereolitography Plant\" which is capable of 3D-printing anything once it is installed on the colony.\nMedicines and electronic parts like micro- and nanoprocessors and other circuitry elements that cannot be produced locally on site\nFood and plants from Earth for consumption and future farming on the planet\nParts for modular habitats\nSome parts for drones and small cargo vehicles.\n\nI got all that down but then I started to think of building a bucket-wheel excavator on site, then suddenly remembered they are powered externally.  I finally came to wonder what kind of reliable power source is the best for such a first-time human departure.\nThe planet is continental just like Earth with plants, water and varying weather. Both on a sci-fi and realistic perspective, what stable and sustainable form of power do you think is BEST for such a scenario?\nI was thinking of bringing on the ship either parts for a:\n\nA small modular nuclear (fission) reactor\nA fusion reactor\nGeothermal plant\nSolar energy\n\nWhat benefits does one bring from the other? I was thinking fusion reactors but thought bringing parts for a small Tokamak that can provide enough power for 300 people would be heavy to bring - or is it? If so, would there be changes needed on what types of cargo should be brought into the ship?\n"},
{"title": "Disorganised and riddled", "tag": ["riddle", "word"], "author": "Auribouros", "link": "https://puzzling.stackexchange.com/questions/115892/disorganised-and-riddled", "content": "\nExplain every line, as well as the title.\nI am here, I am alive, rapidly decaying, moving all the time,\nI am used by politicians, doctors, or even niche artists,\nIn fiction, I can be custom, achromic, or even mixed with machines,\nI need to be fed, pumpkins, kidney beans, or maybe some meat,\nI can sadly be hurt, by pointes, tinea, fire, even myself,\nWhen I die, I am given a tomb, rain pouring down on my rest.\nWhat am I?\n"},
{"title": "Spell out an integer... in NDos' way", "tag": ["code-golf", "string", "integer"], "author": "Dannyu NDos", "link": "https://codegolf.stackexchange.com/questions/246530/spell-out-an-integer-in-ndos-way", "content": "\nObjective\nGiven a positive integer, spell it out in the conlang I made.\nSpecification\nLet \\$n\\$ be the inputted integer. \\$n\\$ shall be spelled out in the following specification. The entire spelling is case sensitive.\nWith the decimal expansion of \\$n\\$, let d be the least significant nonzero digit of \\$n\\$.\nFirst, d shall be spelled out like this:\n\n1 = Qun\n\n2 = Pis\n\n3 = Tel\n\n4 = Kal\n\n5 = Pan\n\n6 = Soh\n\n7 = Set\n\n8 = Qok\n\n9 = Nof\n\n\nSecond, an appropriate suffix (or a \"particle\" in linguistic sense?) will immediately follow. This is judged by two boolean conditions: (A) Whether d has any trailing zeros, and (B) whether d is not the only nonzero digit.\n\nIf neither holds, the suffix shall be em.\n\nIf only (A) holds, the suffix shall be eh.\n\nIf only (B) holds, the suffix shall be at.\n\nIf both hold, the suffix shall be om.\n\n\nThird, if (A) held, the length of the trailing zeros shall be spelled out recursively.\nFinally, if (B) held, d and the trailing zeros shall be stripped off, and the remaining digits shall be spelled out recursively.\nAll words shall be intercalated by a single ASCII 0x20 whitespace.\nExamples\n\n1 = Qunem\n\n2 = Pisem\n\n7 = Setem\n\n10 = Quneh Qunem\n\n11 = Qunat Qunem\n\n12 = Pisat Qunem\n\n19 = Nofat Qunem\n\n20 = Piseh Qunem\n\n42 = Pisat Kalem\n\n69 = Nofat Sohem\n\n100 = Quneh Pisem\n\n109 = Nofat Quneh Qunem\n\n440 = Kalom Qunem Kalem\n\n666 = Sohat Sohat Sohem\n\n1945 = Panat Kalat Nofat Qunem\n\n2000 = Piseh Telem\n\n2022 = Pisat Pisat Piseh Qunem\n\n44100 = Qunom Pisem Kalat Kalem\n\n144000 = Kalom Telem Kalat Qunem\n\n\\$10^{60}\\$ = Quneh Soheh Qunem\n\n\\$10^{63}\\$ = Quneh Telat Sohem\n\n\nRules\nI/O format is flexible. Standard loopholes apply.\nAs for input, those that are not positive integers fall in don't care situation.\nAs for output, trailing whitespaces are permitted, but leading whitespaces are not.\nUngolfed solution\nHaskell\nimport Data.List\nimport Numeric.Natural\n\nspellNDos :: Natural -> String\nspellNDos 0 = \"\"\nspellNDos n = go (reverse (show n)) where\n    go \"\" = \"\"\n    go str = let\n        (zeros, digit:remaining) = partition ('0'==) str\n        digitSpell = case digit of\n            '1' -> \"Qun\"\n            '2' -> \"Pis\"\n            '3' -> \"Tel\"\n            '4' -> \"Kal\"\n            '5' -> \"Pan\"\n            '6' -> \"Soh\"\n            '7' -> \"Set\"\n            '8' -> \"Qok\"\n            _   -> \"Nof\"\n        suffix = case (null zeros, null remaining) of\n            (False, False) -> \"om \"\n            (False, _    ) -> \"eh \"\n            (_    , False) -> \"at \"\n            _              -> \"em \"\n        in digitSpell ++ suffix ++ spellNDos (genericLength zeros) ++ go remaining\n\n"},
{"title": "When do you receive the benefit to not leaving traces with Pass Without Trace?", "tag": ["dnd-5e", "spells", "invisibility"], "author": "Groody the Hobgoblin", "link": "https://rpg.stackexchange.com/questions/197939/when-do-you-receive-the-benefit-to-not-leaving-traces-with-pass-without-trace", "content": "\nPass without Trace says:\n\nA veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks (...) A creature that receives this bonus leaves behind no tracks or other traces of its passage.\n\nWe have a situation where we are riding invisible while under Pass without Trace though the desert. We think that we would not leave traces or kick up dust doing so, as we receive the bonus, whether we use it to sneak or not. Riding at full speed, we would be discoverable by sound, as we are not moving stealthily, but would leave no visible traces.\nOur DM maintains that by rules as written, you only \"have\" the bonus when you are employing stealth, and therefore will leave traces and visible clues to movement, unless you use Dexterity (Stealth) to sneak.\n"},
{"title": "What actually causes the barrel adjuster to change tension in a cable?", "tag": ["barrel-adjuster"], "author": "ebrts", "link": "https://bicycles.stackexchange.com/questions/83653/what-actually-causes-the-barrel-adjuster-to-change-tension-in-a-cable", "content": "\nSee the image below for my mental model of a barrel adjuster.  It's essentially just a metal tube that gets longer or shorter as you twist.  I also understand that making it shorter will add tension to a cable and making it longer will reduce tension by adding slack.  I use these all the time to index my gears and adjust breaks.\nWhat I don't understand is how it actually works.  As far as I can tell, it's just an independent little dingus that gets longer or shorter while the cable continues to move freely through it.\nWhat am I missing?  How is it actually tightening the cable?\n\n"},
{"title": "At what point does a convert become a Roman Catholic?", "tag": ["catholicism", "conversion"], "author": "Ashpenaz", "link": "https://christianity.stackexchange.com/questions/90739/at-what-point-does-a-convert-become-a-roman-catholic", "content": "\nIf someone who is baptized outside of Roman Catholicism converts to Roman Catholicism, what specific act makes them a Roman Catholic? At what point does the convert say, \"I am no longer Anglican (say), I am now Roman Catholic?\" Since baptism is an irrevocable sign of joining the Church, what is the sign that someone has irrevocably become Roman Catholic? Is that sign a sacrament?\n"},
{"title": "Minimal pair for hidden quantity", "tag": ["pronunciation", "word-comparison"], "author": "Joonas Ilmavirta", "link": "https://latin.stackexchange.com/questions/18138/minimal-pair-for-hidden-quantity", "content": "\nIs there an example where the quantity of a vowel makes a difference in a syllable that is heavy by position?\nFor a concrete example, this does happen in Finnish (where long vowels are written as double): 'autonsa' ≠ 'autoonsa'.\nIn Latin I can only think of something at a word boundaries: manŭs ≠ manūs, but the second syllable scans long if the next word starts with a consonant.\nWhat I am looking for is something like this but word-internally, not in the last syllable unless it comes with a consonant cluster that renders it long independent of the following word.\nA pair like pĕsca/pēsca would be perfect — but with real Latin words unlike these of course.\nIf there is no such minimal pair, any suggestions for something that comes close would be welcome.\nI'm open to treating the diphthongs ae and oe as ē, for example.\nIt is possible to know the quantity of a vowel in a syllable long by position, so it is at least in principle possible to have such a minimal pair.\n"},
{"title": "Trying to remember a Sci-fi movie or TV series where a human space fighter pilot chases an alien space fighter craft to the edge of a black hole", "tag": ["story-identification", "movie", "aliens", "tv", "black-hole"], "author": "Phoenix11", "link": "https://scifi.stackexchange.com/questions/262491/trying-to-remember-a-sci-fi-movie-or-tv-series-where-a-human-space-fighter-pilot", "content": "\nTrying to remember a movie or TV series.\nOne scene I remember. The space fighter pilot is part of a squadron that has had a group dogfight with a bunch of nasty alien craft. One alien craft escapes so 1 pilot chases the alien craft to the edge of a black hole of sorts (could be a collapsing star), but the pilot gets caught in the gravitational field and gets slowly sucked in. He tries reverse thrusters and no luck. As he’s getting sucked in to the depths, he plays a Jonny Cash Burning Ring of Fire song (I think) over the radio and the song slowly gets all distorted (like batteries going flat in a walkman) from the gravitational field.\n"},
{"title": "How do you generate a random number with a pre-specified probability distribution?", "tag": ["probability-or-statistics", "random", "distributions"], "author": "Quasar Supernova", "link": "https://mathematica.stackexchange.com/questions/267332/how-do-you-generate-a-random-number-with-a-pre-specified-probability-distributio", "content": "\nI want to generate a random real number between 0 and 1 but not distributed uniformly but with a probability distribution say, 2 Sin[ pi x ]^2 which integrates to 1 and peaks at $x = 1/2$.\nI tried looking for Biased random variables in the HELP tab, but it did not show any hits.\nThis is my PDF:\npdf = 2 Sin[Pi x]^2\n\n"},
{"title": "What is the French for 310?", "tag": ["pluriel", "nombres"], "author": "Aadil Hoda", "link": "https://french.stackexchange.com/questions/50220/what-is-the-french-for-310", "content": "\nI am at the beginner level of French. I came across some numbers and their French equivalent. I am confused whether it will be cent/cents in 310?\nI noticed that generally it should be plural if the quantity is more than one, so it has to be cents in the French for 310. But I saw one answer where it is trois cent dix.\nPlease help me understand this concept around numbers.\n"},
{"title": "Difference between std::vector::empty and std::empty", "tag": ["c++", "std"], "author": "lursyy", "link": "https://stackoverflow.com/questions/72004319/difference-between-stdvectorempty-and-stdempty", "content": "\nTo check if a vector v is empty, I can use std::empty(v) or v.empty(). I looked at the signatures on cppreference, but am lacking the knowledge to make sense of them. How do they relate to each other? Does one implementation call the other?\nI know that one comes from the containers library and the other from the iterators library, but that is about it.\n"},
{"title": "Firing one engineer in a very small team", "tag": ["team", "termination", "startup", "junior", "seniority"], "author": "user134392", "link": "https://workplace.stackexchange.com/questions/184400/firing-one-engineer-in-a-very-small-team", "content": "\nSo this is not my real account. Sorry about that.\nI run a startup where all fulltime employees also have an equity stake (with vesting and a 1 year cliff). One of the engineers we (I) brought on board around a months back is not really (at all) working out. His interviews and live coding sessions were fine. We are all remote (~30% could be onsite but now we chose to be fully remote).\nThe company is exploring a new photo application. Design has started working on the initial stages (user research, user stories, etc.). Simultaneously we wanted to test the feasibility of doing some advanced things like filters, overlays, etc.\nSo the idea was while the designers would work the preliminary sketches, engineering would do a feasibility study of some of the more advanced features. In order to start with these advanced features, the first step is obviously a simple photo capture / display app.\nThe engineer in question was tasked with this. In one on one calls, as well as in group sessions, he communicated that the simple image capture / display is done and he had started working on the more advanced things. This is the first task he has been given as the new engineer on the team.\nI asked for a code review session to see his progress. During this, I discovered that even simple image capture or display wasn't working right. Later I found out (and he agreed) that he essentially copied the code of a purportedly full fledged photo app from another repository on github. This in itself (reusing code) is normal but what was shocking was that none of it actually worked. It was obvious he did not even test any of it before declaring that he was done.\nI consider this a serious breach of trust. In principle, this is also a matter of competence, but in practice, getting a simple image app up and running is actually very straightforward - there are many ready to use components. He chose not to use the components and put together the app himself, but just to clone a pre-made entire app. And he didn't test it. This to me indicates supreme negligence, laziness and carelessness.\nDuring the code review he mentioned he did not do anything because the designs were not ready and that he'd start once they were. This is in direct contraction to earlier understandings and agreements.\nI think I should fire him summarily because it is only been a month.\nQuestions around this -\n\nWhat and how much should I communicate in the firing message? Should I have a conversation first and try to work things out (and risk more excuses and problems at a later stage)?\n\nWhat should I communicate to the small (around 5-6 people) engineering team? Asking them to use/test the app he uploaded will suffice because they are all engineers. Or should I just say he left due to personal/whatever reasons? Or that I fired him due to lack of commitment / breach of trust?\n\nIn terms of \"experience\", I am around the middle and I run engineering. There are some very senior engineers and a very junior guy. Would it make sense to have a semi-consultative session with the senior engineer? What do I tell the junior who expected to be working under the guy I want to fire?\n\n\n"},
{"title": "Alien diplomat unable to lie settles bet about the most wonderful planet in the galaxy", "tag": ["story-identification", "short-stories"], "author": "PotatoCrisp", "link": "https://scifi.stackexchange.com/questions/262517/alien-diplomat-unable-to-lie-settles-bet-about-the-most-wonderful-planet-in-the", "content": "\nA short story I read at college, 1977-86ish. I think it was a side story from a bigger space opera series I never read, but it stands alone.\nThere was a interplanetary mining(?) vessel, the kind where a crew spend years away from home for big pay on return. There were quite a few men aboard and they had next to nothing to do on their down-time.\nOne of the guys was gambler and maybe a card-sharp. He would play any game, bet on anything and always won. As a result he had finagled most of the crew out of all the pay they were owed at the end of the job. Everyone was disgruntled about this.\nThe cook was an old hand from a poor, broken-down and obscure little colony. He never lost an opportunity to mention his home planet (I'll call it X) and praise it up. This made the men laugh because they knew he came from a real jerkwater planet.\nAt the end of the contract they were on their way back to their home system when the ship was contacted by an intergalactic diplomat needing a ride. They diverted and picked him up.\nThe diplomat was from a different Vulcan-like race, emotionally controlled and incapable of lying. This was why they were employed in interplanetary relations, trade negotiations and so on.\nSo the cook whipped up a celebratory dinner for their august guest and it was soon evident that the alien was haughty and exceptionally proud. The men took turns quizzing him about where he'd been and it seemed he'd been everywhere and knew the culture of every place. They asked his opinion on various subjects and he always replied truthfully, unable to lie.\nUnlike the rest, the cook had hung on to some of his money. Sensing a way to get his hands on it all, the gambler suggested asking the visitor about X, sure that he would show the cook up. Fiercely loyal, the cook accepted the bet, all his remaining pay against all the gambler's winnings.\nSo the gambler asked the visitor if he was familiar with the cook's people. He replied indeed he had been to their planet. The next question was how would he describe X.\nThe visitor grinned and stated without any shadow of a doubt X was the most wonderful place in the galaxy.\nThe gambler and the rest of the men were dumbstruck, but they couldn't argue, the authority had spoken. And the gambler was forced to hand over all his winnings, which the cook returned to the rest.\nSo how had the cook won the bet?\nWell, in the old cook's native language, which he knew the interplanetary diplomat was familiar with...\n\n ...X means HOME.\n\nNow I'm sure that although the setting is original the story sounds like an old one. It's got an Arabian Nights tale ring to it. So there may be alternates but I'm wondering which space opera series this version may have belonged to.\n"},
{"title": "\"I only have a friend” vs \"I only have one friend”", "tag": ["difference", "phrases"], "author": "user153499", "link": "https://ell.stackexchange.com/questions/313974/i-only-have-a-friend-vs-i-only-have-one-friend", "content": "\nWhat's the difference between these sentences?\n\nI only have a friend.\n\n\nI only have one friend.\n\nOr are they actually the same?\n"},
{"title": "Can simple DC/DC linear regulators be used in parallel?", "tag": ["parallel", "load", "linear-regulator"], "author": "PMF", "link": "https://electronics.stackexchange.com/questions/617153/can-simple-dc-dc-linear-regulators-be-used-in-parallel", "content": "\nCan linear regulators such as the L7805CV (Rated at 5V output, 1A max) be used in parallel? I need to create 5V from 12V, but I need more than 1A, so a single regulator won't do. Can they just be wired up in parallel to achieve a higher maximum current?\n\nsimulate this circuit – Schematic created using CircuitLab\nI know there are more efficient alternatives than linear regulators, but this shall be a cheap backup solution if the primary DC/DC converter fails.\n"},
{"title": "What is meant, exactly, by nonrepeating when talking about irrational numbers?", "tag": ["elementary-number-theory", "recreational-mathematics", "math-history", "irrational-numbers"], "author": "Numerical Disintegration", "link": "https://math.stackexchange.com/questions/4435375/what-is-meant-exactly-by-nonrepeating-when-talking-about-irrational-numbers", "content": "\nMy question is referring to the exact definition mathematicians use when describing the decimal expansions of irrational numbers as \"nonterminating and nonrepeating.\" Now, I understand, at least ostensibly, what is meant by \"nonterminating\" and the phrase \"nonrepeating\" seems simple enough to understand, but I've always wondered what is meant by the exact definition:\nIt was always my understanding that the term \"nonrepeating\" was referring to a specific sequence of numbers showing up no more than once in the decimal expansion. I'm confused as to the exact criteria for fulfilling this requirement.\n\nSurely it can't be just a sequence of $1$ number. In the sense that $\\pi$ starts with the number $3$ and then the number $3$ shows up again, and again and again an infinite number of times.\n\nIs it a sequence of $2$ numbers repeating then? For instance in the golden ratio $\\phi = 1.61803398874989$ we could take any $2$ number sequence, say $61$ or $98$ or $33$ and would it be sufficient to say that that particular sequence never shows up again? That seems highly unlikely given the \"nonterminating\" nature of the decimal expansions for irrational numbers.\n\nIf not, then what sequence of $n$ numbers is sufficient to declare a number \"nonrepeating?\"\n\nMoreover, philosophically, how does it make sense that any sequence of numbers doesn't show up more than once? When, necessarily, an irrational number has an infinitely long decimal expansion and a sequence of numbers (at least for practical determination) would be finite up to some $n \\in \\mathbb{N}$\n\nI mean, the idea that the sequence length be infinitely long just seems like a convenient workaround that dilutes the significance of the \"nonrepeating\" quality of irrational numbers in the first place. Since, if you ever came upon a sequence that repeated for whatever $n$-digit sequence you had you could always just say \"oh actually I meant this $(n+1)$-digit sequence instead!\" and keep adding digits to the sequence ad infinitum.\n\n\n\nPerhaps the term isn't referring to repeating sequences of numbers but rather the same numbers repeating one after another.\n\nBut this cannot be the case as we saw above with the Golden Ratio, in the short approximation written out we have $2$ cases where the same number is repeated immediately (i.e., $33$ and $88$) we also see this in this approximation for $\\pi = 3.1415926535897932384626433$\n\nSo, if the term \"nonrepeating\" doesn't refer to repetition of sequences of numbers $n$ digits long, nor does it the consecutive repetition of the same number, then what else would it refer to?\n"},
{"title": "Is this polynomial a square?", "tag": ["code-golf", "math", "decision-problem", "polynomials"], "author": "alephalpha", "link": "https://codegolf.stackexchange.com/questions/246526/is-this-polynomial-a-square", "content": "\nGiven an integral polynomial \\$p\\$, determine if \\$p\\$ is a square of another integral polynomial.\nAn integral polynomial is a polynomial with only integers as coefficients.\nFor example, \\$x^2+2x+1\\$ should gives truthy, because \\$x^2+2x+1 = (x+1)^2\\$.\nOn the other hand, \\$2x^2+4x+2\\$ should gives falsy: \\$2x^2+4x+2 = (\\sqrt{2}x+\\sqrt{2})^2\\$. but \\$\\sqrt{2}x+\\sqrt{2}\\$ is not an integral polynomial.\nInput\nA polynomial, in any reasonable format. For example, the polynomial \\$x^4-4x^3+5x^2-2x\\$ may be represented as:\n\na list of coefficients, in descending order: [1,-4,5,-2,0];\na list of coefficients, in ascending order: [0,-2,5,-4,1];\na list of pairs of (coefficient, degree), in any order: [(1,4),(-4,3),(5,2),(-2,1),(0,0)];\na map with degrees as keys and coefficient as values: {4:1,3:-4,2:5,1:-2,0:0};\na string representation of the polynomial, with a chosen variable, say x: \"x^4-4*x^3+5*x^2-2*x\";\na built-in polynomial object, e.g., x^4-4*x^3+5*x^2-2*x in PARI/GP.\n\nOutput\nA value representing whether the polynomial is a square. You can choose to\n\noutput truthy/falsy using your language's convention (swapping is allowed), or\nuse two distinct, fixed values to represent true (affirmative) or false (negative) respectively.\n\nThis is code-golf, so the shortest code in bytes wins.\nTestcases\nHere I use coefficient lists in descending order:\nTruthy\n[]\n[25]\n[1,2,1]\n[1,2,1,0,0]\n[1,4,0,-8,4]\n[4,28,37,-42,9]\n[4,0,-4,4,1,-2,1]\n[1,-12,60,-160,240,-192,64]\n\nFalsy\n[-1]\n[1,111]\n[2,4,2]\n[1,2,1,0]\n[1,3,3,1]\n[1,-4,5,-2,0]\n[4,0,-4,4,1,2,1]\n[1,-9,30,-45,30,-9,1]\n\n"},
{"title": "How do I uninstall a script?", "tag": ["server", "20.04", "apache2"], "author": "Joseph Smith", "link": "https://askubuntu.com/questions/1404630/how-do-i-uninstall-a-script", "content": "\nI use this script\nbash <(curl -s https://pterodactyl-installer.se)\n\nfrom this website https://www.ghostcap.com/install-pterodactyl-panel/\nand I want to just uninstall the entire script and every file it downloaded.\n"}
]